[
  {
    "page": 11,
    "text": "Copyrighted material licensed to Intertek Inform for All Roof Take-offs.\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\nwww standards.org.au\n\n9 AS 1562.1:2018\n\nWhere fitted, fastener sealing washers and all other seals in direct contact with the cladding\nshall be made from materials that conform to ASTM D2000 Specification 3BA 606, Al4\nB13, such as EPDM or neoprene chlorinated rubber. Fillers shall be completely\nencapsulated when conductive materials such as carbon are used. Linear electrical\nresistance between contact points on opposing surfaces of the washer shall be greater than\n1 MQ when tested at 1000 V.\n\nNOTE: The use of inert or non-conductive fillers is preferred, as the risk of a conductive rubber\nwith a carbon-metal corrosion cell is eliminated.\n\nWhere fitted, load spreading washers shall be compatible with any other material that they\nare in contact with (e.g. fasteners or cladding material),\n\n2.2.2 Aluminium\nAluminium fastenings shall conform to the following requirements:\n\n(a) Nails and hook bolts shall be made from extruded aluminium: 6000 series aluminium\nalloy.\n\n(b) _Fastenings such as clips, brackets and washers shall be made from sheet aluminium:\n3000 series or 5000 series aluminium alloy.\n\n(c) Screws and other fasteners made from non-compatible materials such as stainless\nsteel shall be isolated from aluminium cladding.\nNOTE: See Tables C2 and C3, Appendix C, for further information.\n\n2.2.3. Copper and copper alloys\n\nThe fastenings used to retain copper and copper alloy sheeting shall be of a compatible\nmaterial.\n\n2.2.4 Steel\nSteel fastenings shall conform to the following requirements:\n\n(a) Non-self-drilling screws, self-drilling screws, nails and bolts shall be in accordance\nwith AS/NZS 1214, AS 2334, AS 3566.1, AS 1789 or AS 4397.\n\n(b) Clips, brackets, straps and washers shall be in accordance with Clause 2.1.3 or\nClause 2.1.6.\n\n2.2.5. Stainless steel\n\nStainless steel fastenings shall conform to the composition requirements of ISO 3506\n(series) and shall be in accordance with Clause 2.2.1.\nNOTE: See Table C3, Appendix C, for further information,\n\n2.2.6 Rivets\n\nRivets shall conform to IFI 114.\n\n© Standards Australia"
  },
  {
    "page": 12,
    "text": "AS 1562.1:2018 10\n\nSECTION 3. DESIGN\n\n3.1 SCOPE\n\nThis Section sets out requirements for the design of cladding systems comprising cladding,\nand cladding fasteners.\n\nNOTES:\n\n1 Guidance on roof ventilation is given in Appendix A.\n\n2 Guidance on water penetration is given in Appendix B.\n\n3. This Section requires the specification of the supporting members in order to define the\ncapacity of the cladding fasteners, but the scope of this Section does not cover the design of\nthe supporting members themselves.\n\n4 Cladding systems are not normally designed to carry additional loads from accessories fixed\ndirectly to the cladding, e.g. air-conditioning units, vents or antennas. If these are to be fixed\ndirectly to the cladding then the capacity of the cladding to carry these loads should be\nverified.\n\n3.2. LOADING\n3.2.1 General\n\n‘The cladding and its fastenings to the supporting member shall be designed to withstand the\nloads derived from the actions specified in AS/NZS 1170.1, AS/NZS 1170.2 and\nAS/NZS 1170.3, when combined in accordance with the load combinations in\nAS/NZS 1170.0, for the particular circumstances in which the cladding and fastening\nsystem will be used.\n\nMaterials and installation specifications shall achieve resistance to the loads and actions\nidentified in this Clause (3.2) and shall be recorded in design documentation as specified in\nClause 3.5\n\nsensed to Intertek Inform for All Roof Take-offs,\n\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\n3.2.2, Imposed actions\n\nImposed actions shall be appropriate for the roof categories defined in AS/NZS 1170.1. For\nroof category R2, the design documentation (see Clause 3.5) shall clearly identify whether\nthe roof is designed for either one of the following:\n\n(a) Cladding providing direct support and that persons may walk or stand anywhere on\nthe roof without causing damage to the sheet\n\nCopyrighted material\n\n(b) Cladding over which boards or ladders are required to be laid, and including\nindication of —\n\n(i) the positions on the roof sheet on which a person may walk or stand without\ncausing damage to the sheet;\n\n(ii) temporary walkways that are to be provided for access; or\n\n(iii) the marking of roofing with a visible sign or sticker with the warning\n“FOOT TRAFFIC IS NOT ALLOWED’.\n\n3.2.3 Wind actions\n\nLocal pressure factors defined in AS/NZS 1170.2 or edge region pressures defined in\nAS 4055 shall be applied to the external pressures for cladding system at edges, ridges and\ncorners of building roofs and walls.\n\n© Standards Australia www standards.org.au"
  },
  {
    "page": 13,
    "text": "a AS 1562.1:2018\n\n3.2.4 Snow and ice action\n\nDesign for loads from the accumulation of snow shall conform to AS/NZS 1170.3.\nNOTE: AS/NZS 1170.3 does not address loads from hail\n\n3.2.5. Lateral restraint\n\nCladding is not considered to be efficient restraint for supporting structures against\nbuckling, in particular cold-formed steel purlins, unless experimental (test) data are\navailable for cladding assemblies including cladding, its fixings and supporting structures.\n\n3.2.6 Thermal\n\nduced movement or loadings\n\nThermally induced effects shall be accommodated by either—\n\n(a) demonstrating that the system can resist the applied thermal loads; or\nNOTE: This may be achieved by limiting maximum length between top and bottom rows of\nfasteners on a sheet.\n\n(b) detailing the system to absorb the applied thermal movement.\n\nNOTE: Absorbtion of applied thermal movements may be achieved by the—\n(a) provision of expansion joints; and/or\n(b)__use of elongated slots on sheets.\n\nNOTES:\n\n1 Appendix € provides guidance on typical coefficients of linear expansion.\n\n2 To give an indication of the extent of thermal expansion that needs to be considered, an\nunrestrained 15m steel sheet expands through approximately 12 mm and aluminium for\n24 mm for a temperature variation from 0°C to 65°C. In practice, cladding movement in roofs\nmay be less than this due to many factors including friction and flexibility of the supporting\nstructure\n\n3. Practical demonstration of bracing capacity of the sheeting may be required for systems with\nprovision for accommodating thermal induced movement (see Appendix E).\n\nsensed to Intertek Inform for All Roof Take-offs,\n\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\n4 Transverse thermal expansion in ribbed cladding is absorbed by lateral distortion of the ribs.\n\n3.3 ROOF DRAINAGE\n3.3.1 General\n\nThe cladding system shall provide water resistance and drainage when subjected to a\nrainfall resulting from a storm having an average recurrence interval of 100 years as\ndetermined in accordance with AS/NZS 3500.3 or local meteorological data.\n\nNOTE: Roof drainage is affected by—\n\n(a) the length and pitch (i.e. slope) of the roof\n\nCopyrighted material\n\n(b) the profile of the cladding and its water channel drainage capacity;\n(c) the risk of ponding in the case of a low pitch roof;\n\n(a) anti-capillary feature geometry and location design on side laps;\n\n(e) the potential penetration of water through end and side laps;\n\n(©) drainage from an upper roof to a lower roof:\n\n(g) change of pitch or a concave roof leading to a transition from laminar to turbulent flow;\n(h) any penetrations in the roof that affect the flow of water down the roof pitch; and\n\n(i) deflection of a roof structure will alter the roof pitch; the initial pitch, which therefore,\nshould include an allowance for any permanent deflection of the roof structure, in particular\nlong-term deflections in timber-framed structures.\n\nwww standards.org.au @ Standards Australia"
  },
  {
    "page": 14,
    "text": "AS 1562.1:2018 2\n\n3.3.2. Roof pitch\nMinimum roof pitch shall be the greater of —\n(a) the value given in Table 3.1; and\n\n(b) _ the value calculated in accordance with Appendix D.\n\nTABLE 3.1\nMINIMUM ROOF CLADDING PITCH FOR PLANAR ROOFS\n\nRoof cladding ee\nClosely spaced sheeting ribs with depth less than 20 mm 3\nCorrugated closely spaced sheeting ribs with depth between 20 mm and 30 mm 3\nCorrugated closely spaced sheeting ribs over 30 mm depth 2\nClosely spaced trapezoidal sheeting ribs with depth between 20 mm and 35 mm 3\nTrapezoidal sheeting ribs between 20 mm and 35 mm 2\n“Trapezoidal sheeting ribs over 35 mm depth ni\nSecret fastened sheeting ribs up to 30 mm depth 2\nSecret fastened sheeting ribs over 30 mm depth i\nLong run metal tile 10\nMetal tiles < 25 mm upstand 15\nMetal tiles > 25 2\n\nNOTE: Sections of curved roofs below the minimum pitch in the design documentation\n(see Clause 3.5) shall be fully sealed at side laps for profiles with depth up to 35 mm, and not\nincorporate end laps.\n\n3.3.3, Rainwater goods\n\n3\ng\ns\n3\n@\nz\n5\nE\n2\nz\n2\n2\n2\n3\n5\n\nRainwater goods shall conform to AS 2179.1\n\n3.4. PROTECTION AGAINST CORROSION\n3.4.1 General\n\nCladding systems shall be of materials, fasteners and details that are suitable for the\nenvironment in which they are to be used.\n\nNOTE: For guidance on corrosivity zones in Australia and their effect on the corrosion of steel\nand other metals, see AS 4312\n\nCopyrighted material\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\n3.4.2. Direct contact\nCladding systems shall be designed so that direct contact between incompatible materials\ndoes not occur.\n\nNOTES:\n\n1 A method of separating incompatible materials is the use of an impervious non-conducting\nmaterial between the incompatible elements.\n\n2 Appendix C provides guidance on acceptable combinations of metals in the light of current\nknowledge, based on the premise that the area of cladding and accessories is relatively large\nin comparison to that of the fastener material.\n\n3. If the atmosphere inside a building with metal cladding contains corrosive gases or vapours,\nsome roof materials will need extra protection against the corrosive agents if the cladding is\nnot lined. Such extra protection should also apply to the fastenings and accessories.\n\n4 Ponding of rainwater and accumulation of dust can accelerate corrosion\n\n5 The life of most metals in severe marine atmospheres and industrial areas with atmospheres\ncontaminated by acid-bearing agents can be extended by the use of special painting\nprocedures (refer to AS/NZS 2312.1)\n\n© Standards Australia www standards.org.au"
  },
  {
    "page": 15,
    "text": "Copyrighted material licensed to Intertek Inform for All Roof Take-offs.\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\nwww standards.org.au\n\n3 AS 1562.1:2018\n\n3.4.3 Run-off\n\nThe roof shall be designed to prevent run-off from one surface damaging a lower surface.\n\nNOTE: Appendix C provides guidance on acceptable combinations of upper and lower metals and.\nalloys with regard to run-off from one to the other.\n\n3.5. DESIGN DOCUMENTATION\n\nDesign documentation shall include the following:\n\n(a) A statement that the design meets the requirements of this Standard.\n\n(b) A description of system elements for cladding, fastening and supporting members\nwhich shall include:\n\n(i) Profile and dimensions of cladding\n(ii) Specification of materials,\n\n(iii) Dimensions, specification and configurations of fasteners.\n(iv) Testing criteria as specified in Section S.\n\n(v) Maximum sheeting overhang\n\n(vi) Cladding spans (e.g. span dimensions for end spans, internal spans, single\nspans).\n\n(©) If roofing, the imposed action category, that is, R1 or R2 and any special access\nrequirements (see Clause 3.2.2) and design concentrated imposed actions.\n\n(a) Design wind pressures for edge, corner and general zones defined in AS 4055 or\nASINZS 1170.2.\n\n(©) A description of the corrosion protection system.\n(£) Minimum roof pitch as a function of roof length and rainfall intensity.\n\n(g) Limitations on fixing of rooftop-mounted equipment such as solar panels or\nair-conditioning equipment directly to the cladding.\n(h) Limitations on bracing and lateral restraint capacity of the cladding system.\nNOTE: Information on minimum pitch may be presented as a table or diagram.\nReference to design documentation within this Standard shall be limited to the requirements\nlisted in Items (a) to (h).\n\nAny information in addition to the requirements listed in (a) to (h) shall be clearly indicated\nas recommendations and shall not form part of the mandatory design documentation.\n\n© Standards Australia"
  },
  {
    "page": 16,
    "text": "AS 1562.1:2018 4\n\nSECTION 4 INSTALLATION\n\n4.1 OVERVIEW\n4.1.1 General\n\nThe roof and wall cladding systems shall be installed as specified in design documentation\n(see Clause 3.5).\n\nIn addition, they shall conform to the requirements of Clauses 4.2 to 4.8.\nNOTES:\n\n1 Installation directly to the cladding of rooftop-mounted equipment such as solar panels and\nair-conditioning equipment is not included in this Standard.\n\n2. HB 39 provides guidance on the installation of metal roof and wall cladding.\n4.1.2, Loading during construction\n\nLoads on cladding during construction shall not exceed the loads used in the design of the\ncladding system. Potential additional loads include:\n\n(a) _ Internal pressures for the expected configuration of the building during construction.\nNOTE: This may include absence of ceilings, wall cladding, glazing and doors.\n\n(b) Stacking of materials that exceed the imposed actions for roofs given in\nAS/NZS 1170.1\n\n4.2. SUPPORTING MEMBERS\n\n4.2.1 Spacing of supporting members\n\nSpacing between supporting members shall not exceed the maximum spans detailed in the\ndesign documentation (see Clause 3.5)—\n\nS\ng\ns\n3\n@\nz\n5\nE\n2\nz\n2\n2\n2\n3\n5\n\n(a) _ for cladding spans adjacent to eaves, ridges, hips or end laps of sheets, the end span\ndistances;\n\n(b) in continuous spanning systems, the internal span distances; and\n(c) _ for single spans, the single span distance.\n\n4.2.2. Supports at hips and valleys\n\nCopyrighted material\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\nThe raking cut edges of roof sheets at hips and valleys shall be supported on trimmers that\nare fixed flush with the top face of purlins or battens and span between them. Hip and\nvalley trimmers shall be fixed parallel to the edge of the sheeting and be placed so as to\nenable the fixing of the sheeting and hip capping.\n\n4.2.3. Tolerance in position of supporting members\n\nThe tops of the supporting members shall be in a plane parallel to the specified roof pitch,\nwith a tolerance, in vertical position, of 7 mm per metre length of supporting member.\n\n© Standards Australia www standards.org.au"
  },
  {
    "page": 17,
    "text": "Copyrighted material licensed to Intertek Inform for All Roof Take-offs.\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\n1s AS 1562.1:2018\n\n4.3. LAYING THE SHEETING\n\nAll sheets shall be supported as near to their ends as practicable, notwithstanding that the\nsheet end shall always positively overhang the full width of the supporting surface to\nprevent water intrusion by capillary action. The maximum and minimum unsupported end\noverhang for any type of sheet shall be as specified in the design documentation\n(see Clause 3.5).\n\nThe sheet overhang on valley gutters shall be not less than 100 mm from edge of valley\ngutter, as measured perpendicular to centre-line of valley, unless, in the case of metal tiles,\nit is turned down into the valley.\n\nNOTE: For guidance on the dimensions of sheet overhang, see Figure 4.1\n\nwww standards.org.au @ Standards Australia"
  },
  {
    "page": 18,
    "text": "AS 1562.\n\n018 16\n\nValley gutter turned up\nagainst ridge\n\n[Valley head to be Hip\n[securely tastenes\n| atnage\n\n— Valley timbers\n\n_~ Sheeting not to\nbe fixed through\nvalley gutter\n\n8\nra\nS\ng&\ni)\nE\n§\n\nGalvanized nail\nor cleats bent\nover to fix gutter\nat 500 max.\nspacing\n\nSs\n2\n\nRoof Take-offs.\noftakeo ffs @gmail\n\nipa\nom\n\nQO\n\n\\- Valley gutter turned\ndown into eaves gutter\n\n- Galvanized nail or cleats\n\na\ng Gant over to ee Guaer et\na S00 mat. opacing\n2\n3\n3 “arta\n8 Valley creeper rafter hose\n/ “Alay abe\nvatiy beaie\nSECTION A-A\n\nNOTES:\n\n1 For shallow pierce-fastened cladding, laying the initial sheet at the leeward end of the building for the\nprevailing weather may protect the side laps from the worst anticipated weather. Refer to HB 39 for\nfurther details.\n\nNo further reproduction or distribution permitted, Printed / viewed by:\n\n2 Refer to HB 39 for use of suitably contoured accessories (e-g. caps, filler strips, or mesh), typically at the\n‘eaves, may minimize entry of birds or vermin to the roof space.\n\nDIMENSIONS IN MILLIMETRES\n\nFIGURE 4.1. DETAIL OF SHEET OVERHANG FOR VALLEY GUTTER\n\n© Standards Australia www standards.org.au"
  },
  {
    "page": 19,
    "text": "” AS 1562.1:2018\n\n4.4 FASTENING\n4.4.1 General\nFasteners shall be those specified in the system configuration description from the\ndocumentation and appropriate for the type of supporting member used.\nNOTE: Only the correct cladding/fastener system as specified in the design documentation\n(see Clause 3.5) has demonstrated the resistance to wind forces of the system.\nWhere the system uses washers as part of the fastening assembly, the washers shall be\nappropriate for the wind loading and the sheeting profile and material.\n\nFasteners shall be located in the centre of the supports or, where hook bolts are used, as\nclose as practicable to the top edge of supports.\n\nWhere holes are punched for the installation of fasteners, the operation shall not cause local\ndistortion to the sheet.\n\nNOTE: Special tools for punching holes may be available from the roofing manufacturer.\n4.4.2. Pierced-fastened cladding\n\nFasteners in valleys or crests shall be tightened to compress flexible seals without\ndeforming the cladding or damaging any washers.\nWhere nails are used, any local distortion shall not extend beyond the area covered by the\nwasher and seal\nNOTES:\n1 Compressed washers should be used to minimize water leakage and provide cladding\nperformance as per design documentation (see Clause 3.5)\n2 Care is to be exercised to prevent the entrapment of swarf between the seal and the cladding\nfor both crest and valley fasteners.\n4.4.3, Concealed-fastened cladding\n\nSheeting shall be installed onto the clip system using the methods outlined in the\nconfiguration description from the design documentation.\n\nsensed to Intertek Inform for All Roof Take-offs,\n\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\n4.5 CLADDING LAPS\nEnd laps for sheeting systems shall be as follows:\n(2) 200 mm min. to 300 mm max. for roof sheeting on pitches less than 1:4 (15°).\n\n(b) 150 mm min. to 250 mm max. for roof sheeting on pitches steeper than 1:4 (15°).\n\nCopyrighted material\n\n(©) 100 mm min. to 200 mm max. for wall cladding,\nFor end laps, the upper sheet shall sit above the lower sheet.\n\nFor pierce-fastened cladding systems, the end lap shall be positioned symmetrically over a\nsupport. For concealed-fastened cladding systems, the end lap shall be positioned on the\nhigh side of a support and not interfere with (just clear of) the concealed fastening system.\nNOTES:\n1 Some concealed fastened claddings are not suitable for end lapping—refer to design\ndocumentation (see Clause 3.5).\n2. HB 39 provides guidance for sealing of side and end laps.\n\n4.6 PROTECTION OF CLADDING DURING INSTALLATION\n\nAlll installation debris including fasteners, metal clips and filings shall be removed from the\nroof and adjacent gutters,\n\nNOTE: Surface coatings should be protected from damage during installation as per\n‘manufacturer's recommendations.\n\nwww standards.org.au @ Standards Australia"
  },
  {
    "page": 20,
    "text": "AS 1562.1:2018 Is\n\n4.7, PROJECTIONS THROUGH THE CLADDING\nFlashings shall be installed around any projections through roof or wall cladding so that all\npans drain.\nAlll cut sections of the sheeting shall be supported by additional roof framing,\n\nNOTE: Refer to HB 39 for examples on flashings around penetrations.\n\ng 4.8 FLASHINGS\n8 4.8.1 General\nS\ngz Roof flashings and cappings shall be purpose-made, machine-folded sheet metal sections of\n® materials compatible with all upstream and downstream roof covering materials, including\nE guitering and downpipes.\n&§ NOTES:\n¢ £ 1 Refer to HB 39 for watertightness details including anti-capillary breaks.\n38 2. Flashings and cappings should, as far as practicable, have material specifications that are\nse compatible with the adjacent roof sheeting or wall cladding as per Appendix C but with\ncg reference to minimum thickness as defined i Table-4:1\ngs ‘\n2 48.2 jum thickness\n8\n3 The minimum sheet metal thickness for roof flashings and cappings shall be as given in\nres Table 4.1\nEs\n22 TABLE 4.1\n#= MINIMUM THICKNESS FOR FLASHINGS AND CAPPINGS\n23\n$= Material Paint cont Metalic] Basethickness | Grade\na5 Materials \"aint coating aaty a\nag is painedtopaioed =\nBe lop ag oss\nBE calvaind ste Presid ars oss |assvorax00\n2 3 Galvanized steel Unpainted 2450 oss 6550 oF G300\n53 Stainless steel Prepainted/unpainted os\n23\nes Zine 0.65\n55 ‘Aluminiumizine coated steet |Prepaintedtunpainted — [AZ150 oss G300\ngs Ridiitsinabsioc coiatassl |ieepetiiaarbapsineed  |AziSH 042 asso\ng coated steel\ns ‘Alnminien/ibchnagpediam -|apalaand a rn ame\n5 coated steel\n3 ‘Aluminium/zine/magnesium | Prepainted [Amio0 082 550\ns coated steet\nAluminium/zine/magnesium [Unpainted famias 042 Gss0\ncoated steel\nNOTES:\n\n1 Materials may be used for flashings and capping except for zine which is restricted to flashings.\n2 This Table is based on HB 39, Table 8.1.2.\n\n© Standards Australia www standards.org.au"
  }
]