[
  {
    "page": 1,
    "text": "AS 1562.1:2018\n\nDesign and installation of sheet roof and wall cladding\n\nPart 1: Metal\n\nAustralian Standard®",
    "book_page": "Cover Front 1",
    "comment_for_internal_use_": "COMPLETE"
  },
  {
    "page": 2,
    "text": "This Australian Standard® was prepared by Committee BD-014, Metal Cladding. It was approved on behalf of the Council of Standards Australia on 7 February 2018. This Standard was published on 1 March 2018.\n\nThe following are represented on Committee BD-014:\n• Australian Aluminium Council\n• Australian Building Codes Board\n• Australian Garage Door Association\n• Australian Steel Association\n• Australian Steel Institute\n• Bureau of Steel Manufacturers of Australia\n• Consult Australia\n• Curtin University of Technology\n• Cyclone Testing Station, James Cook University\n• Housing Industry Association\n• Insulated Panels Council Australasia\n• Insurance Council of Australia\n• Metal Roofing & Cladding Association\n• Queensland University of Technology\n\nThis Standard was issued in draft form for comment as DR AS 1562.1:2017.\n\nStandards Australia wishes to acknowledge the participation of the expert individuals that contributed to the development of this Standard through their representation on the Committee and through the public comment period.\n\nKeeping Standards up-to-date:\nAustralian Standards® are living documents that reflect progress in science, technology and systems. To maintain their currency, all Standards are periodically reviewed, and new editions are published. Between editions, amendments may be issued.\n\nStandards may also be withdrawn. It is important that readers assure themselves they are using a current Standard, which should include any amendments that may have been published since the Standard was published.\n\nDetailed information about Australian Standards, drafts, amendments and new projects can be found by visiting www.standards.org.au\n\nStandards Australia welcomes suggestions for improvements, and encourages readers to notify us immediately of any apparent inaccuracies or ambiguities. Contact us via email at mail@standards.org.au, or write to Standards Australia, GPO Box 476, Sydney, NSW 2001.",
    "book_page": "Cover Front 2",
    "comment_for_internal_use_": "COMPLETE"
  },
  {
    "page": 3,
    "text": "AS 1562.1:2018\n\nAustralian Standard®\n\nDesign and installation of sheet roof and wall cladding\n\nPart 1: Metal\n\nFirst published as part of AS CA42—1968.\nAS CA42 revised and redesignated AS 1562—1973.\nSecond edition 1980.\nAS 1562—1973 revised and redesignated in part AS 1562.1—1992.\nSecond edition 2018.\n\n\n\nCOPYRIGHT\n© Standards Australia Limited\n\nAll rights are reserved. No part of this work may be reproduced or copied in any form or by any means, electronic or mechanical, including photocopying, without the written permission of the publisher, unless otherwise permitted under the Copyright Act 1968.\n\nISBN 978 1 76072 008 7",
    "book_page": "1",
    "comment_for_internal_use_": "COMPLETE"
  },
  {
    "page": 4,
    "text": "Copyrighted material licensed to Intertek Inform for All Roof Take-offs.\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\nAS 1562.1:2018 2\n\nPREFACE\n\nThis Standard was prepared by the Standards Australia Committee BD-014, Metal\nCladding, to supersede AS 1562.1—1992,\n\nThis Standard is part of a series on sheet roof and wall cladding which comprises the\nfollowing:\n\nAS\n1562 Design and installation of sheet roof and wall cladding\n1562.1 Part 1: Metal (this Standard)\n\n1562.3 Part 3: Plastic\n\nAS/NZS\n1562 Design and installation of sheet roof and wall cladding\n1562.2 Part 2: Corrugated fibre-reinforced cement\n\nThe objective of this Standard is to provide designers and installers with clear information\nto determine the minimum requirements for the correct and safe design and installation of\nsheet metal roof and wall cladding, based on the best available evidence and current\nindustry practice.\n\nThe main technical changes to the Standard are the following:\n(a) Revision of the design section to align with current versions of AS/NZS 1170 series.\n\n(b) Revision of the installation section to provide flashing requirements to minimize the\nrisk of water ingress, and to highlight the importance of fixing ancillary equipment to\nthe roof structure rather than just the roof cladding.\n\n(c) Revision of the testing section to align it with current practice whereby roof cladding\nfor cyclonic areas must withstand a Low-Hi-Low test regime.\n\n(d) Alignment with HB 39 and relevant Australian Standards including AS/NZS 1170\nseries and AS 4040 series.\n\n(©) Clarification of the design aspects such as rainwater capacity, adjacent metal\nsuitability, and minimum fixing requirements for flashings have been clarified.\n\n(6) Incorporation of factors for variation of repeat load testing have to align with current\npractice.\n\n(g) Requirements to fix flashing of wall and roof joints and ridge capping with screw\nconnectors at a minimum spacing of either 300 mm for some flashing edges and\n600 mm for others.\n\n(h) Improved presentation of design documentation and test report for the performance\nverification of cladding systems.\n\nIn this Standard, notes are for information and guidance only. Statements expressed in\nmandatory terms in notes to tables or figures are deemed to be requirements of this\nStandard\n\nThe terms ‘normative’ and ‘informative’ have been used in this Standard to define the\napplication of the appendix to which they apply. A ‘normative’ appendix is an integral part\nof a Standard, whereas an ‘informative’ appendix is only for information and guidance.",
    "book_page": "2",
    "comment_for_internal_use_": ""
  },
  {
    "page": 5,
    "text": "Roof Take-offs,\noftakeo ffs @gmail\n\nsensed to Intertek Inform for\n\nNo further reproduction or distribution permitted. Printed / viewed by:al\n\nCopyrighted material\n\ng\ng\nra\nS\ng&\ni)\nE\n§\n\nCONTENTS\n\nSECTION | SCOPE AND GENERAL\n1.1 SCOPE... \" . z5\n12 NORMATIVE REFERENCES i i i\n13 DEFINITIONS... . evn evetrenenen\n\nSECTION 2 MATERIALS\n\n2.1 SHEETS, ROLLED SECTIONS AND EXTRUSIONS USED FOR THE\nMANUFACTURE OF CLADDING AND ACCESSORIES\n\n2.2 SHEET FASTENINGS SE esis 2 z\n\nSECTION 3 DESIGN\nBL SCOPE. .sccsrrenenen\nBQ LOADING .esevsssesersenen .. . evsnnentee\n3.3 ROOF DRAINAGE... sini —\n34 PROTECTION AGAINST CORROSION —\n3.5 DESIGN DOCUMENTATION.\n\nSECTION 4 INSTALLATION\n4.1 OVERVIEW.\n42. SUPPORTING MEMBERS.\n\n4.3 LAYING THE SHEETING .....0.0 ss i i\"\n\n44 FASTENING......\n4.3 CLADDING LAPS\n46 PROTECTION OF CLADDING DURING INSTALLATION\n\n4.7 PROJECTIONS THROUGH THE CLADDING ...s.rcssssctsereectserene\n4.8 FLASHINGS j..cccssssnsestrsntnntvtstntnstntntniesnntntetsnntnnsee\n\nSECTIONS TESTING\n5.1 GENERAL...\n5.2 TEST SPECIMEN\n53. DERIVATION OF DESIGN VALUES...\n\n5.4 RESISTANCE TO CONCENTRATED LOADS sree .\n5.5 RESISTANCE TO WIND PRESSURES FOR NON-CYCLONE REGIONS\n\n5.6 RESISTANCE TO WIND PRESSURES FOR CYCLONE REGIONS........\n\nAPPENDICES\nA ROOF VENTILATION, WATER VAPOUR AND CONDENSATION...\nB WATER PENETRATION jcc a vest\n© MATERIAL PROPERTIES... —\nD_ ROOF PITCH CALCULATION FOR WATER DRAINAGE...\nE BRACING i asec i\n\nBIBLIOGRAPHY scence ses vets svt\n\nAS 1562.1:2018\n\nPage\n\nart\n4\n5\n\neneseeen 24",
    "book_page": "3",
    "comment_for_internal_use_": ""
  },
  {
    "page": 6,
    "text": "AS 1562.1:2018 4\n\nSTANDARDS AUSTRALIA\n\nAustralian Standard\nDesign and installation of sheet roof and wall cladding\n\nPart 1: Metal\n\nSECTION 1 SCOPE AND GENERAL\n\n1.1 SCOPE\n\nThis Standard sets out requirements for the design and installation of self-supporting metal\nroof and wall cladding subjected to out-of-plane external actions and in-plane thermally\ninduced actions, permanent actions on walls and steep roofs and frictional drag of wind and\nsnow actions.\n\nNOTES:\n\n1 The term ‘metal roof” is considered to include metal tiles.\n\n2 Stressed-skin design (diaphragm action) is not covered in this Standard. Design and\ninstallation of cladding for stressed-skin buildings should be undertaken using relevant\nmanuals such as EN 1993-1-3. Information on evaluating bracing capacity of cladding is\ngiven in Appendix E.\n\n3. Some of the design and testing provisions in this Standard may apply to metal faced structural\ninsulated panels although some of the material specifications for these products are not\ncovered in this Standard,\n\nsensed to Intertek Inform for All Roof Take-offs,\n\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\n1.2. NORMATIVE REFERENCES\n\n‘The following are the normative documents referred to in this Standard:\n\nz\n$ NOTE: Documents referenced for informative purposes are listed in the Bibliography\né AS\n3 1397 Continuous hot-dip metallic coated steel sheet and strip—Coatings of zine\n5 and zine alloyed with aluminium and magnesium\na 1566 Copper and copper alloys—Rolled flat products\n\n1789 Eleetroplated zine (clectrogalvanized) coatings on ferrous articles (batch\n\nprocess)\n2179 Specifications for rainwater goods, accessories and fasteners\n2179.1 Part 1: Metal shape or sheet rainwater goods, and metal accessories and\nfasteners\n\n2334 Steel nails—Mettie series\n\nAS\n\n3566 Self-drilling screws for the building and construction industries\n\n3566.1 Part 1: General requirements and mechanical properties\n\n4040 Methods of testing sheet roof and wall cladding\n\n4040.1 Part 1: Resistance to concentrated loads\n\n4040.2 Part 2: Resistance to wind pressures for non-cyclone regions\n\n4040.3 Part 3: Resistance to wind pressures for cyclone regions\n\n4055 Wind loads for housing\n\n© Standards Australia www standards.org.au",
    "book_page": "4",
    "comment_for_internal_use_": ""
  },
  {
    "page": 7,
    "text": "sensed to Intertek Inform for All Roof Take-offs,\n\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\nCopyrighted material\n\nwww standards.org.au\n\n5 AS 1562.1:2018\n\nAS\n\n4397 Electroplated coatings of zinc on steel fasteners with imperial threads\n\nAS/NZS\n\n1170 Structural design actions\n\n1170.0 Part 0: General principles\n\n1170.1 Part 1: Permanent, imposed and other actions\n\n1170.2 Part 2: Wind actions\n\n1170.3 Part 3: Snow and ice actions\n\n1214 Hot dipped galvanized coatings on threaded fasteners (ISO metric coarse\nthread series) (ISO 10684:2004, MOD)\n\n1734 Aluminium and aluminium alloys—Flat sheet, coiled sheet and plate\n\n2728 Prefinished/prepainted sheet metal products for interior/exterior building\napplications—Performance requirements\n\n3500 Plumbing and drainage\n\n3500.3 Part 3: Stormwater drainage\n\nASTM\n\nA240 Standard Specification for Chromium and Chromium-Nickel Stainless Steel\nPlate, Sheet, and Strip for Pressure Vessels and for General Applications\n\nA276 Standard Specification for Stainless Steel Bars and Shapes\n\nA666 Standard Specification for Annealed or Cold-Worked Austenitic Stainless\nSteel Sheet, Strip, Plate, and Flat Bar\n\n2000 Standard Classification system for rubber products in automotive\napplications\n\nIso\n\n3506 Mechanical properties of corrosion-resistant stainless steel fasteners (series)\n\n9223 Corrosion of metals and alloys—Cortosivity of atmospheres—Classification,\ndetermination and estimation\n\nEN\n\n10088 Stainless steels\n\n1088-1 Part 1: List of stainless steels\n\nIF Industrial Fasteners Institute, USA\n\n114 Break Mandrel Blind Rivets\n\n1.3, DEFINITIONS\nFor the purpose of this Standard, the definitions below apply.\n1.3.1 Accessories\n\nRidge, gable and hip capping, flashings and fasteners.\n\n1.3.2. Anti-capil\n\nry feature\n\nA depression in the rolled profile that creates a gap wider than 1 mm at the side lap of\ninstalled sheets, which prevents capillary action drawing moisture into the side lap.\n\n1.3.3 Cladding system\n\nRoof or wall cladding, accessories and fasteners, which are defined by a single profile,\nsheet thickness, material grade and specification, fastener type and size, fastener spacing\n(p), and washer configuration, and which may have various spans (S).\n\n© Standards Australia",
    "book_page": "5",
    "comment_for_internal_use_": ""
  },
  {
    "page": 8,
    "text": "AS 1562.1:2018 6\n\n1.3.4 Creep\nThe phenomenon of increasing deformation under constant load.\n1.3.5 Cyclone regions\n\nWind Regions C and D as defined in AS/NZS 1170.2 or site classifications C1 to C4 in\nAS 4055,\n\n1.3.6 Design documentation\n\nDetails of the mandatory requirements for cladding systems that are in accordance with this\nStandard (see Clause 3.5),\n\nNOTE: Design documentation is used to ensure that the design and the test verification of the\nperformance of the cladding matches the requirements for installation (see Clause 4).\n\n1.3.7 De-indexing\nThe releasing of the interlock between preformed sheets.\n1.3.8 Fastener spacing (p)\n\n‘The maximum distance between fasteners, measured along the centre-line of the supporting\nmember.\n\n1.3.9 Non-cyclone regions\n\nWind Regions A and B as defined in AS/NZS 1170.2 or site classifications N1 to N6 in\nAS 4055,\n\n1.3.10 Oil canning\n\nMinor elastic distortion in the form of waviness or out-of-flatness in a preformed sheet,\nnormally caused by local buckling of the sheet metal.\n\n1.3.11 Pan\n\nS\ng\ns\n3\n@\nz\n5\nE\n2\nz\n2\n2\n2\n3\n5\n\nThe flat, or curved portion between the ribs in a pan-type preformed sheet.\n\n1.3.12. Pierce fastened profile\n‘A metal cladding fixed only by screws or nails that pass through the cladding.\n1.3.13 Preformed sheet\n\n‘A metal roofing sheet preformed to increase its resistance to vertical loads, which may have\nlongitudinal ribs of corrugated type or of pan type, in which the distance between the ribs is\ngreater than the width of the ribs, or be formed in other ways to represent tiles or other\nshapes.\n\nCopyrighted material\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\n1.3.14 Rainwater goods\nDownpipes, rainheads, sumps, spreaders, soakers, nozzles and eaves, box and valley\ngutters.\n1.3.15 Rib\nA longitudinal upstand produced by bending, folding or crimping the sheet during\nmanufacture\n1.3.16 Secret (concealed) fastened profile\n‘A metal cladding fixed by secret (hidden) brackets, clips, ete including standing seam\nprofile.\n\nNOTE: Where deformation of the sheeting under ultimate test loading could cause loss of\n\nengagement of the fastening system, typically from opening of rib from deformation of pans or\nunzipping of laps, the sheeting is regarded as secret fastened profile.\n\n© Standards Australia www standards.org.au",
    "book_page": "6",
    "comment_for_internal_use_": ""
  },
  {
    "page": 9,
    "text": "7 AS 1562.1:2018\n\n1.3.17. Serviceal\n\nity limit state\n\nState that corresponds to conditions beyond which specified service criteria for a structure\nor structural element are no longer met.\n\n1.3.18 Shall\nIndicates that a statement is mandatory.\n1.3.19 Should\n\nIndicates a recommendation.\n\n1.3.20 Span (S)\n\nThe distance between the centre-lines of sheet fastenings to adjacent purlins or battens\nmeasured normal to such centre-lines.\n\n1.3.21, Strength limit state\nState associated with collapse or with other similar forms of structural failure.\n1.3.22 Supporting member\n\n‘The member to which the cladding is attached (e.g. purlins, battens, girts),\n1.3.23 Unelipping\n\nThe releasing of preformed secret fixed sheets from their fastenings.\n\nsensed to Intertek Inform for All Roof Take-offs,\n\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\nCopyrighted material\n\nwww standards.org.au @ Standards Australia",
    "book_page": "7",
    "comment_for_internal_use_": ""
  },
  {
    "page": 10,
    "text": "AS 1562.1:2018 8\n\nSECTION 2. MATERIALS\n2.1 SHEETS, ROLLED SECTIONS AND EXTRUSIONS USED FOR THE\nMANUFACTURE OF CLADDING AND ACCESSORIES\n2.1.1 Aluminium\n\nAluminium for the manufacture of sheet cladding shall conform to the requirements of\nAS/NZS 1734. The copper content of any aluminium alloy used in sheet roof and wall\ncladding shall not exceed 0.25%.\n\nAluminium alloys used shall be alloy 5251 or 5052 with temper not exceeding H 38.\nBase metal thickness shall be not less than 0.7 mm.\n\n2.1.2 Copper\n\nCopper shall conform to the requirements of AS 1566, relevant to sheet and coil products.\n2.1.3 Steel\n\nThe material shall be metallic-coated steel.\n\nExcept where the requirements of Clause 2.1.5 apply, the material shall conform to the\nrequirements of AS 1397 for minimum coating Class 2450, AZ150 or AM125.\n\n2.14 Stainless steel\n\nStainless steel shall conform to the requirements of ASTM A240, ASTM A276,\nASTM A666, EN 10088-1 or JIS G4305, as applicable.\n\n2.1.5 Prepainted\n\nPrepainted and organic film/metal laminate products shall conform to the requirements of\nAS/NZS 2728.\n\n2.1.6 Other metals\n\nS\ng\ns\n3\n@\nz\n5\nE\n2\nz\n2\n2\n2\n3\n5\n\nMetals that are not specifically referred to may be used, provided they fulfil all other\nrequirements of this Standard.\nNOTE: Duc to toxicity, lead is not recommended for cladding.\n\n2.2. SHEET FASTENINGS\n\nCopyrighted material\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\n2.2.1 General\n\nFasteners shall be durable and corrosion resistant. The coating shall be appropriate for the\ncorrosion environment specified in ISO 9223 with a design life equal to or superior to the\ncladding. Fasteners shall be compatible with any other material with which they may be in\ncontact or, if not compatible, shall be electrolytically insulated from such material to\nminimize the risk of dissimilar metal corrosion.\n\nNOTES:\n\n1 Fasteners should only be used in the applications and environments recommended by the\nfastener manufacturer.\n\n2 The fastenings, including any retained mandrels (e.g. rivet stems), may be suitably plated or\ncoated to achieve the necessary corrosion resistance and compatibility. Such platings or\ncoatings should be sufficiently robust to remain substantially undamaged by the fixing\nprocess.\n\n3. For information on all materials referenced in Clause 2.2, see Table C3, Appendix C.\n\n4 Fora comparison table from AS 4312, see Table C2, Appendix C.\n\n© Standards Australia www standards.org.au",
    "book_page": "8",
    "comment_for_internal_use_": ""
  },
  {
    "page": 11,
    "text": "Copyrighted material licensed to Intertek Inform for All Roof Take-offs.\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\nwww standards.org.au\n\n9 AS 1562.1:2018\n\nWhere fitted, fastener sealing washers and all other seals in direct contact with the cladding\nshall be made from materials that conform to ASTM D2000 Specification 3BA 606, Al4\nB13, such as EPDM or neoprene chlorinated rubber. Fillers shall be completely\nencapsulated when conductive materials such as carbon are used. Linear electrical\nresistance between contact points on opposing surfaces of the washer shall be greater than\n1 MQ when tested at 1000 V.\n\nNOTE: The use of inert or non-conductive fillers is preferred, as the risk of a conductive rubber\nwith a carbon-metal corrosion cell is eliminated.\n\nWhere fitted, load spreading washers shall be compatible with any other material that they\nare in contact with (e.g. fasteners or cladding material),\n\n2.2.2 Aluminium\nAluminium fastenings shall conform to the following requirements:\n\n(a) Nails and hook bolts shall be made from extruded aluminium: 6000 series aluminium\nalloy.\n\n(b) _Fastenings such as clips, brackets and washers shall be made from sheet aluminium:\n3000 series or 5000 series aluminium alloy.\n\n(c) Screws and other fasteners made from non-compatible materials such as stainless\nsteel shall be isolated from aluminium cladding.\nNOTE: See Tables C2 and C3, Appendix C, for further information.\n\n2.2.3. Copper and copper alloys\n\nThe fastenings used to retain copper and copper alloy sheeting shall be of a compatible\nmaterial.\n\n2.2.4 Steel\nSteel fastenings shall conform to the following requirements:\n\n(a) Non-self-drilling screws, self-drilling screws, nails and bolts shall be in accordance\nwith AS/NZS 1214, AS 2334, AS 3566.1, AS 1789 or AS 4397.\n\n(b) Clips, brackets, straps and washers shall be in accordance with Clause 2.1.3 or\nClause 2.1.6.\n\n2.2.5. Stainless steel\n\nStainless steel fastenings shall conform to the composition requirements of ISO 3506\n(series) and shall be in accordance with Clause 2.2.1.\nNOTE: See Table C3, Appendix C, for further information,\n\n2.2.6 Rivets\n\nRivets shall conform to IFI 114.\n\n© Standards Australia",
    "book_page": "9",
    "comment_for_internal_use_": ""
  },
  {
    "page": 12,
    "text": "AS 1562.1:2018 10\n\nSECTION 3. DESIGN\n\n3.1 SCOPE\n\nThis Section sets out requirements for the design of cladding systems comprising cladding,\nand cladding fasteners.\n\nNOTES:\n\n1 Guidance on roof ventilation is given in Appendix A.\n\n2 Guidance on water penetration is given in Appendix B.\n\n3. This Section requires the specification of the supporting members in order to define the\ncapacity of the cladding fasteners, but the scope of this Section does not cover the design of\nthe supporting members themselves.\n\n4 Cladding systems are not normally designed to carry additional loads from accessories fixed\ndirectly to the cladding, e.g. air-conditioning units, vents or antennas. If these are to be fixed\ndirectly to the cladding then the capacity of the cladding to carry these loads should be\nverified.\n\n3.2. LOADING\n3.2.1 General\n\n‘The cladding and its fastenings to the supporting member shall be designed to withstand the\nloads derived from the actions specified in AS/NZS 1170.1, AS/NZS 1170.2 and\nAS/NZS 1170.3, when combined in accordance with the load combinations in\nAS/NZS 1170.0, for the particular circumstances in which the cladding and fastening\nsystem will be used.\n\nMaterials and installation specifications shall achieve resistance to the loads and actions\nidentified in this Clause (3.2) and shall be recorded in design documentation as specified in\nClause 3.5\n\nsensed to Intertek Inform for All Roof Take-offs,\n\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\n3.2.2, Imposed actions\n\nImposed actions shall be appropriate for the roof categories defined in AS/NZS 1170.1. For\nroof category R2, the design documentation (see Clause 3.5) shall clearly identify whether\nthe roof is designed for either one of the following:\n\n(a) Cladding providing direct support and that persons may walk or stand anywhere on\nthe roof without causing damage to the sheet\n\nCopyrighted material\n\n(b) Cladding over which boards or ladders are required to be laid, and including\nindication of —\n\n(i) the positions on the roof sheet on which a person may walk or stand without\ncausing damage to the sheet;\n\n(ii) temporary walkways that are to be provided for access; or\n\n(iii) the marking of roofing with a visible sign or sticker with the warning\n“FOOT TRAFFIC IS NOT ALLOWED’.\n\n3.2.3 Wind actions\n\nLocal pressure factors defined in AS/NZS 1170.2 or edge region pressures defined in\nAS 4055 shall be applied to the external pressures for cladding system at edges, ridges and\ncorners of building roofs and walls.\n\n© Standards Australia www standards.org.au",
    "book_page": "10",
    "comment_for_internal_use_": ""
  },
  {
    "page": 13,
    "text": "a AS 1562.1:2018\n\n3.2.4 Snow and ice action\n\nDesign for loads from the accumulation of snow shall conform to AS/NZS 1170.3.\nNOTE: AS/NZS 1170.3 does not address loads from hail\n\n3.2.5. Lateral restraint\n\nCladding is not considered to be efficient restraint for supporting structures against\nbuckling, in particular cold-formed steel purlins, unless experimental (test) data are\navailable for cladding assemblies including cladding, its fixings and supporting structures.\n\n3.2.6 Thermal\n\nduced movement or loadings\n\nThermally induced effects shall be accommodated by either—\n\n(a) demonstrating that the system can resist the applied thermal loads; or\nNOTE: This may be achieved by limiting maximum length between top and bottom rows of\nfasteners on a sheet.\n\n(b) detailing the system to absorb the applied thermal movement.\n\nNOTE: Absorbtion of applied thermal movements may be achieved by the—\n(a) provision of expansion joints; and/or\n(b)__use of elongated slots on sheets.\n\nNOTES:\n\n1 Appendix € provides guidance on typical coefficients of linear expansion.\n\n2 To give an indication of the extent of thermal expansion that needs to be considered, an\nunrestrained 15m steel sheet expands through approximately 12 mm and aluminium for\n24 mm for a temperature variation from 0°C to 65°C. In practice, cladding movement in roofs\nmay be less than this due to many factors including friction and flexibility of the supporting\nstructure\n\n3. Practical demonstration of bracing capacity of the sheeting may be required for systems with\nprovision for accommodating thermal induced movement (see Appendix E).\n\nsensed to Intertek Inform for All Roof Take-offs,\n\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\n4 Transverse thermal expansion in ribbed cladding is absorbed by lateral distortion of the ribs.\n\n3.3 ROOF DRAINAGE\n3.3.1 General\n\nThe cladding system shall provide water resistance and drainage when subjected to a\nrainfall resulting from a storm having an average recurrence interval of 100 years as\ndetermined in accordance with AS/NZS 3500.3 or local meteorological data.\n\nNOTE: Roof drainage is affected by—\n\n(a) the length and pitch (i.e. slope) of the roof\n\nCopyrighted material\n\n(b) the profile of the cladding and its water channel drainage capacity;\n(c) the risk of ponding in the case of a low pitch roof;\n\n(a) anti-capillary feature geometry and location design on side laps;\n\n(e) the potential penetration of water through end and side laps;\n\n(©) drainage from an upper roof to a lower roof:\n\n(g) change of pitch or a concave roof leading to a transition from laminar to turbulent flow;\n(h) any penetrations in the roof that affect the flow of water down the roof pitch; and\n\n(i) deflection of a roof structure will alter the roof pitch; the initial pitch, which therefore,\nshould include an allowance for any permanent deflection of the roof structure, in particular\nlong-term deflections in timber-framed structures.\n\nwww standards.org.au @ Standards Australia",
    "book_page": "11",
    "comment_for_internal_use_": ""
  },
  {
    "page": 14,
    "text": "AS 1562.1:2018 2\n\n3.3.2. Roof pitch\nMinimum roof pitch shall be the greater of —\n(a) the value given in Table 3.1; and\n\n(b) _ the value calculated in accordance with Appendix D.\n\nTABLE 3.1\nMINIMUM ROOF CLADDING PITCH FOR PLANAR ROOFS\n\nRoof cladding ee\nClosely spaced sheeting ribs with depth less than 20 mm 3\nCorrugated closely spaced sheeting ribs with depth between 20 mm and 30 mm 3\nCorrugated closely spaced sheeting ribs over 30 mm depth 2\nClosely spaced trapezoidal sheeting ribs with depth between 20 mm and 35 mm 3\nTrapezoidal sheeting ribs between 20 mm and 35 mm 2\n“Trapezoidal sheeting ribs over 35 mm depth ni\nSecret fastened sheeting ribs up to 30 mm depth 2\nSecret fastened sheeting ribs over 30 mm depth i\nLong run metal tile 10\nMetal tiles < 25 mm upstand 15\nMetal tiles > 25 2\n\nNOTE: Sections of curved roofs below the minimum pitch in the design documentation\n(see Clause 3.5) shall be fully sealed at side laps for profiles with depth up to 35 mm, and not\nincorporate end laps.\n\n3.3.3, Rainwater goods\n\n3\ng\ns\n3\n@\nz\n5\nE\n2\nz\n2\n2\n2\n3\n5\n\nRainwater goods shall conform to AS 2179.1\n\n3.4. PROTECTION AGAINST CORROSION\n3.4.1 General\n\nCladding systems shall be of materials, fasteners and details that are suitable for the\nenvironment in which they are to be used.\n\nNOTE: For guidance on corrosivity zones in Australia and their effect on the corrosion of steel\nand other metals, see AS 4312\n\nCopyrighted material\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\n3.4.2. Direct contact\nCladding systems shall be designed so that direct contact between incompatible materials\ndoes not occur.\n\nNOTES:\n\n1 A method of separating incompatible materials is the use of an impervious non-conducting\nmaterial between the incompatible elements.\n\n2 Appendix C provides guidance on acceptable combinations of metals in the light of current\nknowledge, based on the premise that the area of cladding and accessories is relatively large\nin comparison to that of the fastener material.\n\n3. If the atmosphere inside a building with metal cladding contains corrosive gases or vapours,\nsome roof materials will need extra protection against the corrosive agents if the cladding is\nnot lined. Such extra protection should also apply to the fastenings and accessories.\n\n4 Ponding of rainwater and accumulation of dust can accelerate corrosion\n\n5 The life of most metals in severe marine atmospheres and industrial areas with atmospheres\ncontaminated by acid-bearing agents can be extended by the use of special painting\nprocedures (refer to AS/NZS 2312.1)\n\n© Standards Australia www standards.org.au",
    "book_page": "12",
    "comment_for_internal_use_": ""
  },
  {
    "page": 15,
    "text": "Copyrighted material licensed to Intertek Inform for All Roof Take-offs.\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\nwww standards.org.au\n\n3 AS 1562.1:2018\n\n3.4.3 Run-off\n\nThe roof shall be designed to prevent run-off from one surface damaging a lower surface.\n\nNOTE: Appendix C provides guidance on acceptable combinations of upper and lower metals and.\nalloys with regard to run-off from one to the other.\n\n3.5. DESIGN DOCUMENTATION\n\nDesign documentation shall include the following:\n\n(a) A statement that the design meets the requirements of this Standard.\n\n(b) A description of system elements for cladding, fastening and supporting members\nwhich shall include:\n\n(i) Profile and dimensions of cladding\n(ii) Specification of materials,\n\n(iii) Dimensions, specification and configurations of fasteners.\n(iv) Testing criteria as specified in Section S.\n\n(v) Maximum sheeting overhang\n\n(vi) Cladding spans (e.g. span dimensions for end spans, internal spans, single\nspans).\n\n(©) If roofing, the imposed action category, that is, R1 or R2 and any special access\nrequirements (see Clause 3.2.2) and design concentrated imposed actions.\n\n(a) Design wind pressures for edge, corner and general zones defined in AS 4055 or\nASINZS 1170.2.\n\n(©) A description of the corrosion protection system.\n(£) Minimum roof pitch as a function of roof length and rainfall intensity.\n\n(g) Limitations on fixing of rooftop-mounted equipment such as solar panels or\nair-conditioning equipment directly to the cladding.\n(h) Limitations on bracing and lateral restraint capacity of the cladding system.\nNOTE: Information on minimum pitch may be presented as a table or diagram.\nReference to design documentation within this Standard shall be limited to the requirements\nlisted in Items (a) to (h).\n\nAny information in addition to the requirements listed in (a) to (h) shall be clearly indicated\nas recommendations and shall not form part of the mandatory design documentation.\n\n© Standards Australia",
    "book_page": "13",
    "comment_for_internal_use_": ""
  },
  {
    "page": 16,
    "text": "AS 1562.1:2018 4\n\nSECTION 4 INSTALLATION\n\n4.1 OVERVIEW\n4.1.1 General\n\nThe roof and wall cladding systems shall be installed as specified in design documentation\n(see Clause 3.5).\n\nIn addition, they shall conform to the requirements of Clauses 4.2 to 4.8.\nNOTES:\n\n1 Installation directly to the cladding of rooftop-mounted equipment such as solar panels and\nair-conditioning equipment is not included in this Standard.\n\n2. HB 39 provides guidance on the installation of metal roof and wall cladding.\n4.1.2, Loading during construction\n\nLoads on cladding during construction shall not exceed the loads used in the design of the\ncladding system. Potential additional loads include:\n\n(a) _ Internal pressures for the expected configuration of the building during construction.\nNOTE: This may include absence of ceilings, wall cladding, glazing and doors.\n\n(b) Stacking of materials that exceed the imposed actions for roofs given in\nAS/NZS 1170.1\n\n4.2. SUPPORTING MEMBERS\n\n4.2.1 Spacing of supporting members\n\nSpacing between supporting members shall not exceed the maximum spans detailed in the\ndesign documentation (see Clause 3.5)—\n\nS\ng\ns\n3\n@\nz\n5\nE\n2\nz\n2\n2\n2\n3\n5\n\n(a) _ for cladding spans adjacent to eaves, ridges, hips or end laps of sheets, the end span\ndistances;\n\n(b) in continuous spanning systems, the internal span distances; and\n(c) _ for single spans, the single span distance.\n\n4.2.2. Supports at hips and valleys\n\nCopyrighted material\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\nThe raking cut edges of roof sheets at hips and valleys shall be supported on trimmers that\nare fixed flush with the top face of purlins or battens and span between them. Hip and\nvalley trimmers shall be fixed parallel to the edge of the sheeting and be placed so as to\nenable the fixing of the sheeting and hip capping.\n\n4.2.3. Tolerance in position of supporting members\n\nThe tops of the supporting members shall be in a plane parallel to the specified roof pitch,\nwith a tolerance, in vertical position, of 7 mm per metre length of supporting member.\n\n© Standards Australia www standards.org.au",
    "book_page": "14",
    "comment_for_internal_use_": ""
  },
  {
    "page": 17,
    "text": "Copyrighted material licensed to Intertek Inform for All Roof Take-offs.\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\n1s AS 1562.1:2018\n\n4.3. LAYING THE SHEETING\n\nAll sheets shall be supported as near to their ends as practicable, notwithstanding that the\nsheet end shall always positively overhang the full width of the supporting surface to\nprevent water intrusion by capillary action. The maximum and minimum unsupported end\noverhang for any type of sheet shall be as specified in the design documentation\n(see Clause 3.5).\n\nThe sheet overhang on valley gutters shall be not less than 100 mm from edge of valley\ngutter, as measured perpendicular to centre-line of valley, unless, in the case of metal tiles,\nit is turned down into the valley.\n\nNOTE: For guidance on the dimensions of sheet overhang, see Figure 4.1\n\nwww standards.org.au @ Standards Australia",
    "book_page": "15",
    "comment_for_internal_use_": ""
  },
  {
    "page": 18,
    "text": "AS 1562.\n\n018 16\n\nValley gutter turned up\nagainst ridge\n\n[Valley head to be Hip\n[securely tastenes\n| atnage\n\n— Valley timbers\n\n_~ Sheeting not to\nbe fixed through\nvalley gutter\n\n8\nra\nS\ng&\ni)\nE\n§\n\nGalvanized nail\nor cleats bent\nover to fix gutter\nat 500 max.\nspacing\n\nSs\n2\n\nRoof Take-offs.\noftakeo ffs @gmail\n\nipa\nom\n\nQO\n\n\\- Valley gutter turned\ndown into eaves gutter\n\n- Galvanized nail or cleats\n\na\ng Gant over to ee Guaer et\na S00 mat. opacing\n2\n3\n3 “arta\n8 Valley creeper rafter hose\n/ “Alay abe\nvatiy beaie\nSECTION A-A\n\nNOTES:\n\n1 For shallow pierce-fastened cladding, laying the initial sheet at the leeward end of the building for the\nprevailing weather may protect the side laps from the worst anticipated weather. Refer to HB 39 for\nfurther details.\n\nNo further reproduction or distribution permitted, Printed / viewed by:\n\n2 Refer to HB 39 for use of suitably contoured accessories (e-g. caps, filler strips, or mesh), typically at the\n‘eaves, may minimize entry of birds or vermin to the roof space.\n\nDIMENSIONS IN MILLIMETRES\n\nFIGURE 4.1. DETAIL OF SHEET OVERHANG FOR VALLEY GUTTER\n\n© Standards Australia www standards.org.au",
    "book_page": "16",
    "comment_for_internal_use_": ""
  },
  {
    "page": 19,
    "text": "” AS 1562.1:2018\n\n4.4 FASTENING\n4.4.1 General\nFasteners shall be those specified in the system configuration description from the\ndocumentation and appropriate for the type of supporting member used.\nNOTE: Only the correct cladding/fastener system as specified in the design documentation\n(see Clause 3.5) has demonstrated the resistance to wind forces of the system.\nWhere the system uses washers as part of the fastening assembly, the washers shall be\nappropriate for the wind loading and the sheeting profile and material.\n\nFasteners shall be located in the centre of the supports or, where hook bolts are used, as\nclose as practicable to the top edge of supports.\n\nWhere holes are punched for the installation of fasteners, the operation shall not cause local\ndistortion to the sheet.\n\nNOTE: Special tools for punching holes may be available from the roofing manufacturer.\n4.4.2. Pierced-fastened cladding\n\nFasteners in valleys or crests shall be tightened to compress flexible seals without\ndeforming the cladding or damaging any washers.\nWhere nails are used, any local distortion shall not extend beyond the area covered by the\nwasher and seal\nNOTES:\n1 Compressed washers should be used to minimize water leakage and provide cladding\nperformance as per design documentation (see Clause 3.5)\n2 Care is to be exercised to prevent the entrapment of swarf between the seal and the cladding\nfor both crest and valley fasteners.\n4.4.3, Concealed-fastened cladding\n\nSheeting shall be installed onto the clip system using the methods outlined in the\nconfiguration description from the design documentation.\n\nsensed to Intertek Inform for All Roof Take-offs,\n\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\n4.5 CLADDING LAPS\nEnd laps for sheeting systems shall be as follows:\n(2) 200 mm min. to 300 mm max. for roof sheeting on pitches less than 1:4 (15°).\n\n(b) 150 mm min. to 250 mm max. for roof sheeting on pitches steeper than 1:4 (15°).\n\nCopyrighted material\n\n(©) 100 mm min. to 200 mm max. for wall cladding,\nFor end laps, the upper sheet shall sit above the lower sheet.\n\nFor pierce-fastened cladding systems, the end lap shall be positioned symmetrically over a\nsupport. For concealed-fastened cladding systems, the end lap shall be positioned on the\nhigh side of a support and not interfere with (just clear of) the concealed fastening system.\nNOTES:\n1 Some concealed fastened claddings are not suitable for end lapping—refer to design\ndocumentation (see Clause 3.5).\n2. HB 39 provides guidance for sealing of side and end laps.\n\n4.6 PROTECTION OF CLADDING DURING INSTALLATION\n\nAlll installation debris including fasteners, metal clips and filings shall be removed from the\nroof and adjacent gutters,\n\nNOTE: Surface coatings should be protected from damage during installation as per\n‘manufacturer's recommendations.\n\nwww standards.org.au @ Standards Australia",
    "book_page": "17",
    "comment_for_internal_use_": ""
  },
  {
    "page": 20,
    "text": "AS 1562.1:2018 Is\n\n4.7, PROJECTIONS THROUGH THE CLADDING\nFlashings shall be installed around any projections through roof or wall cladding so that all\npans drain.\nAlll cut sections of the sheeting shall be supported by additional roof framing,\n\nNOTE: Refer to HB 39 for examples on flashings around penetrations.\n\ng 4.8 FLASHINGS\n8 4.8.1 General\nS\ngz Roof flashings and cappings shall be purpose-made, machine-folded sheet metal sections of\n® materials compatible with all upstream and downstream roof covering materials, including\nE guitering and downpipes.\n&§ NOTES:\n¢ £ 1 Refer to HB 39 for watertightness details including anti-capillary breaks.\n38 2. Flashings and cappings should, as far as practicable, have material specifications that are\nse compatible with the adjacent roof sheeting or wall cladding as per Appendix C but with\ncg reference to minimum thickness as defined i Table-4:1\ngs ‘\n2 48.2 jum thickness\n8\n3 The minimum sheet metal thickness for roof flashings and cappings shall be as given in\nres Table 4.1\nEs\n22 TABLE 4.1\n#= MINIMUM THICKNESS FOR FLASHINGS AND CAPPINGS\n23\n$= Material Paint cont Metalic] Basethickness | Grade\na5 Materials \"aint coating aaty a\nag is painedtopaioed =\nBe lop ag oss\nBE calvaind ste Presid ars oss |assvorax00\n2 3 Galvanized steel Unpainted 2450 oss 6550 oF G300\n53 Stainless steel Prepainted/unpainted os\n23\nes Zine 0.65\n55 ‘Aluminiumizine coated steet |Prepaintedtunpainted — [AZ150 oss G300\ngs Ridiitsinabsioc coiatassl |ieepetiiaarbapsineed  |AziSH 042 asso\ng coated steel\ns ‘Alnminien/ibchnagpediam -|apalaand a rn ame\n5 coated steel\n3 ‘Aluminium/zine/magnesium | Prepainted [Amio0 082 550\ns coated steet\nAluminium/zine/magnesium [Unpainted famias 042 Gss0\ncoated steel\nNOTES:\n\n1 Materials may be used for flashings and capping except for zine which is restricted to flashings.\n2 This Table is based on HB 39, Table 8.1.2.\n\n© Standards Australia www standards.org.au",
    "book_page": "18",
    "comment_for_internal_use_": ""
  },
  {
    "page": 21,
    "text": "19 AS 1562.12\n\n4.8.3. Fastening\n\nAll exposed parts of flashings shall be fastened in accordance with Table 4.2 using\nself-drilling screws. Where the total area is less than 0.25 m*, blind rivets may be used on\nflashings.\nBarge capping shall be fastened on upper and side surfaces.\nNOTE: Many flashings are near or on the edges of the buildings and, therefore, are subjected to\n‘more severe wind pressures than the main body of the roof. They need to be securely fixed to the\nstructure where possible and elsewhere to the cladding.\n\nTABLE 4.2\nFASTENER SPACING FOR FLASHINGS AND CAPPINGS\n\nFlashing type Fastener spacing\nNon-cyclonie wind regions | Cyclonic wind regions\n‘Transverse flashing edge (at an angle to the ribs [At not more than 310 mm | At not more than 310 mm.\nor profile greater than 5°) centres centres\nLongitudinal flashing edge along cladding (at | At not more than the At not more than S00 mm\naan angle less than or equal to 5°) batten/purlin/gict spacing [centres along the cladding\nFlashing edge to material other than metal At the same or less spacing | At not more than 500 mm\ncladding (eg. barge flashing edge fixed to as the fastener spacing on [centres\nconerete wall) the other flashing surface\n(e.g. roof oF wall cladding)\n\nNOTES:\n1 This Table is based on HB 39, Table 8.2(B).\n\n2 Minimum fixing distances are appropriate for flashings of thicknesses presented in Table 4.1\n3. End laps of flashings and eappings may be joined with blind rivets.\n\n3\ng\ns\n3\n@\nz\n5\nE\n2\nz\n2\n2\n2\n3\n5\n\nCopyrighted material\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\nwww standards.org.au @ Standards Australia",
    "book_page": "19",
    "comment_for_internal_use_": ""
  },
  {
    "page": 22,
    "text": "AS 1562.1:2018 20\n\nSECTION 5 TESTING\n\n5.1 GENERAL\n\nTesting is required to demonstrate the conformance of the cladding system with the\nrequirements of this Standard.\n\nNOTES:\n\n1 While testing of accessories is not included in the Standard, pressures and loads and the\nprovisions of this Standard may be used to verify the performance of accessories.\n\n2 By way of example, accreditation bodies which are signatories to the International Laboratory\nAccreditation Cooperation (ILAC) Mutual Recognition Arrangement (MRA) for testing\nlaboratories may be able to offer accreditation against the requirements of\nAS ISO/IEC 17025. A listing of ILAC signatories is available from the ILAC website\n(www.ilac.org). In Australia and New Zealand, the National Association of Testing\nAuthorities (NATA) and International Accreditation New Zealand (IANZ) are signatories to\nthe ILAC MRA.\n\n5.2. TEST SPECIMEN\n\nTest specimens shall be fabricated as full-size assemblies of the documented cladding\nsystem as defined in Clause 3.5.\n\nThe cladding system shall be fully documented in the test report, listing all of the\nparameters in Clause 3.5, including design loads and pressures that are used as the basis of\nthese tests.\n\nThe fabrication of the test specimen in the test rig shall not affect the capacity or failure\nmodes of the system (for example, at boundary conditions of the specimen such as end\nsupports and free edges).\n\nsensed to Intertek Inform for All Roof Take-offs,\n\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\n5.3. DERIVATION OF DESIGN VALUES\n5.3.1 Serviceability test pressure\n\nThe reported test serviceability pressure (P,,) shall be the minimum test pressure (Pismia) at\nserviceability limit as per Clause 5.5.1 and Clause 5.6.2 for all the tests of the same span\nconfigurations and length, on the same profile, material and thickness.\n\n5.3.2. Ultimate test pressure\n\nCopyrighted material\n\nThe reported test ultimate pressure (Pj) shall be the minimum ultimate pressure (Panis)\nthat can be sustained for all the tests of the same span configurations and length on the\nsame profile, material and thickness.\n\n5.3.3. Serviceability design pressure\n\nDesign value for serviceability (Pa.) shall satisfy:\n\n533\n\n‘a sampling factor, which is a function of the number of tests N and the\ncoefficient of variation of structural characteristics V,: as given in Table 5.1\n\nPy = serviceability pressure\n\n© Standards Australia www standards.org.au",
    "book_page": "20",
    "comment_for_internal_use_": ""
  },
  {
    "page": 23,
    "text": "Copyrighted material licensed to Intertek Inform for All Roof Take-offs.\n\nNo further reproduction or distribution permitted, Printed / viewed by:allrooftakeoffs @gm:\n\ng\nra\nS\ng&\ni)\n§\n\n5.3.4 Ultimate design pressure\n\nDesign value for strength (P,,) shall satisfy the following:\n\nPus\nNOTES:\n\nAS 1562.1:2018\n\n53.4\n\na sampling factor which is a function of the number of tests N and the\ncoefficient of variation of structural characteristics Vsc as given in Table 5.1\n\nult\n\nate pressure\n\n1 Strength tests are based on ultimate limit states loads.\n\n2 Deflection tests are based on serviceability limit states loads.\n\nwww standards.org.au\n\nTABLE 5.1\n\nFACTORS TO ALLOW FOR VARIABILITY\nOF STRUCTURAL UNITS (k,)\n\nNo. of units to] Coefficient of variation of structural characteristics\nbe tested 2)\n” 3% 10% 15% 20%\n1 120 1.46 179) 221\n2 Lay 138 Led 1.96\n3 Las 133 156 183\n4 Lis 130 130 74\n5 LB 128 146 1.67\n10 Lio 121 134 149\n20 1.06 113 121 129\n100 101 Lol Low Lot\nNOTES:\n\n1 Where tests evaluate deflection under serviceability limit states loads, a\ncoefficient of 5% may be assumed unless there is evidence showing that\n‘a higher figure is warranted.\n\n‘A coefficient of variation of 10% may be assumed for strength of metal\ncladdings and metal supporting systems unless there is evidence\nshowing that a higher figure is warranted.\n\n3. A coefficient of variation of 20% should be assumed for connection sub-\nassemblies unless there is evidence showing that a different figure is\nwarranted.\n\n4 Higher coefficients of variation for serviceability, strength of cladding\nland strength of connections may be expected if a compliant material\n(e.g. coll) is to be sourced from more than one supplier subsequent to the\ntesting program,\n\nInterpolation is allowed in Table 5.1 within the same category (Vi).\nGuidance on determining the number of units to be tested is available in\nGuide to the Low-High-Low eyelic testing by the Cyclone Testing\nStation.\n\n7 This Table based on Table BI of AS/NZS 1170.0 and Table 8.2.3 of\nAS 4600\n\n© Standards Australia",
    "book_page": "21",
    "comment_for_internal_use_": ""
  },
  {
    "page": 24,
    "text": "AS 1562.1:2018 2\n\n5.4 RESISTANCE TO CONCENTRATED LOADS\n5.4.1 General\n\nThe test requirements of this Clause apply only to roof claddings that support loads as\ndefined in Clause 3.2.2(a) (Cladding providing direct support). Testing shall be performed\nin accordance with AS 4040.1\n\n5.4.2. Serviceabi\n\ntest\n\nFor any part of the path specified by the sheeting manufacturer (see Clause 3.2.2) subjected\nto a concentrated test load for serviceability limit state by the method described in\nAS 4040.1, no de-indexing, unclipping, permanent local deformation, fracture or failure of\nany part of the cladding or failure of the fastening shall occur. The residual deflection\ndirectly under the point of application of the load within a maximum of 5 min after removal\nof the load shall not exceed S/1000 or 1.5 mm, whatever is higher.\n\nThe concentrated load shall be applied to those parts of the cladding that will produce\n‘maximum deflection and maximum permanent deformation.\n\nNOTES:\n\n1 Limits on residual deflection have been included to preserve the appearance of the sheeting\nand to reduce ponding. Residual deflection is normally measured after light tapping of the\nsheeting to settle the sheeting to its rest position.\n\n2 The location of maximum deflection may not necessarily coincide with the position of\nmaximum deformation. When testing for maximum permanent deformation, consideration\nshould be given to the application of the concentrated load directly over a supporting member\nor between sidelap fasteners.\n\n5.4.3 Strength test\n\nWhen any part of the cladding is subjected, for not less than 1 min, to a concentrated test\nload for strength limit state in accordance with AS 4040.1, the load shall be sustained,\nirrespective of any permanent deformation that may occur.\n\nS\ng\ns\n3\n@\nz\n5\nE\n2\nz\n2\n2\n2\n3\n5\n\n5.5 RESISTANCE TO WIND PRESSURES FOR NON-CYCLONE REGIONS\n5.5.1 Serviceability test\n\nFor the cladding system subjected to the test pressure for serviceability limit state in\naccordance with AS 4040.2, the maximum deflection of the cladding relative to the\nsupporting members shall not exceed (5/120 + p/30) except for overhangs where maximum.\ndeflection shall not exceed $/60 + p/30, no de-indexing, unclipping, permanent local\ndeformation, or fracture or failure of any part of the sheeting or of the fastenings shall\noccur, and the residual deflection, 1 min after the removal of the pressure, shall not exceed\n‘5/1000 or 1.5 mm, whichever is higher.\n\nNOTE: See also Note | to Clause 5.4.2.\n\n5.5.2 Strength test\n\nThe cladding system shall be subjected to the test pressure for strength limit state for\nnon-cyclone regions in accordance with AS 4040.2. The pressure shall be sustained and\nwith no failure of fasteners and all parts of the cladding system shall remain in position,\nnotwithstanding any permanent distortion that may occur in the sheeting and fastenings.\n\nCopyrighted material\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\nNOTE: ‘Remain in position’ means that the cladding has not disengaged or separated from any\nfastener/clip/bracket/tongue or along the side laps of the test specimen.\n\n© Standards Australia www standards.org.au",
    "book_page": "22",
    "comment_for_internal_use_": ""
  },
  {
    "page": 25,
    "text": "Copyrighted material licensed to Intertek Inform for All Roof Take-offs.\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\nwww standards.org.au\n\n2a AS 1562.1:2018\n\n5.6 RESISTANCE TO WIND PRESSURES FOR CYCLONE REGIONS\n5.6.1 General\n\nCladding systems to be used in cyclone regions shall be tested for their capacity to resist\n\nlow-cycle fatigue loading. These test requirements shall apply to cladding for both roofs\n\nand walls. Testing shall be performed in accordance with AS 4040.3.\nNOTE: It is important to differentiate between cyclic fatigue failure, associated with\ndisengagement of cladding from its supports after repeated load applications, and static failure\nwhich is associated with a strength capacity of a cladding system. Low cycle fatigue cracking of\ncladding, fixings, immediate supports and their fixings during tropical cyclones is a complex\nprocess where small changes in load, geometry or material properties can significantly affect the\nfatigue performance of the system. At present, there is no way to assess this type of performance\napart from testing,\n\n5.6.2. Serviceabi\n\ntest\n\nThe serviceability test for resistance to wind pressure for cyclone regions shall be as\nspecified in Clause 5.5.1\n\n5.6.3 Strength test\n\nThe cladding system shall be subjected to the sequence of fatigue loading for cyclone\nregions specified in AS 4040.3, and shall have no failure of fasteners and remain in\nposition, notwithstanding any permanent distortion, cracks or tears that may occur in the\nsheeting and fastenings.\nNOTE: ‘Remain in position’ means that the cladding has not disengaged or separated from any\nfastener/clip/bracket/tongue or along the side laps of the test specimen\n\n© Standards Australia",
    "book_page": "23",
    "comment_for_internal_use_": ""
  },
  {
    "page": 26,
    "text": "AS 1562.1:2018 4\n\nAPPENDIX A\nROOF VENTILATION, WATER VAPOUR AND CONDENSATION\n\n(Informative)\n\nAl CAUSES OF CONDENSATION\n\nAll air contains some moisture in the form of water vapour, the amount of which depends\non the local environment. The amount of water vapour that the air can hold is a function of\nits temperature. As air cools, its ability to hold water vapour reduces until such point that it\nis unable to retain water vapour and the excess moisture is released as dew, which is\nreferred to as its dew point temperature. Condensation is the term used to describe moisture\nformation on a surface as a result of air coming into contact with a surface below its dew\npoint temperature. Moisture formed from condensation is referred to as condensate.\n\nAir inside a roof cavity will contain moisture from outdoor air and moisture generated by\nthe activities in the building. Substantial quantities of moisture can be generated from\nactivities within a building such as cooking, washing dishes and clothes, drying clothes\nindoors, combustion heating, showering and bathing, perspiration and the breathing of\noccupants and plants. Moisture can also be generated from other sources such as building\nwater leaks through pipes or unprotected ground moisture. Persistent high levels of\nmoisture in the roof cavity may cause problem condensation.\n\nA2_ ROOF CONDENSATION\n\nThe roof is the most exposed element of the building fabric. On clear still nights the roof,\ntemperature often drops below the outdoor air temperature as it loses heat via radiation to\nthe cold night sky. The cold roof combined with the moisture generated at times within\nhomes makes overnight condensation within roofs likely; however, condensate is also likely\nto dry during the day due to high roof and roof space temperatures. While it is good practice\nto minimize the risk of condensation, significant problems will usually only eventuate if\ncondensation is persistent or condensate becomes trapped. Generally, the risk of persistent\ncondensation in roofs is greatest in the coolest climate zones (NCC climate zones 7 and 8).\nPersistent condensation may also eventuate in other climates with poor detail or in special\ncircumstances, such as when high internal or ground moisture levels are not controlled,\nroofs are unable to adequately dry due to lack of outdoor ventilation or roofs are perpetually\nshaded\n\nsensed to Intertek Inform for All Roof Take-offs,\n\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\nCopyrighted material\n\nA3_ PROBLEMS CAUSED BY CONDENSATION\n\nPersistent condensation or condensate that is unable to dry can cause problems in buildings.\nThe cause is often due to poor design or inappropriate use of materials and once present can\nbe difficult to eliminate. Problems that may be encountered include rotting of timber or\ncorrosion of structural steel components, mould growth that may affect indoor air quality,\nreduction in the efficiency of bulk insulation, physical deterioration of ceilings made from\nabsorbent materials and staining of walls and ceilings. Often repair of condensation effects\nand retrospective control measures are significantly more expensive than measures\navailable to prevent condensation in the first instance.\n\n© Standards Australia www standards.org.au",
    "book_page": "24",
    "comment_for_internal_use_": ""
  },
  {
    "page": 27,
    "text": "2s AS 1562.1:2018\n\nA4 PREVENTING THE EFFECTS OF CONDENSATION\n\nThe underside of metal deck roofs provide conditions under which condensate may occur.\nInsulation, such as sarking, reflective foil, bubble foil or blanket and foil insulation placed\nbeneath the sheeting are of value in reducing the likelihood of condensate forming and\npotentially dripping from under roof sheeting. The insulation membranes should be vapour\nimpermeable to protect the metal roofing from moisture inside the building,\n\nWhen blanket insulation is placed beneath a metal deck roof it should incorporate\nimpermeable foil or similar and installed as a vapour barrier underneath the blanket\ninsulation to prevent moisture from inside the building penetrating and wetting the blanket\ninsulation.\n\nA minimum of draped sarking, reflective foil or bubble foil is recommended to reduce the\nprevalence of condensation in climates with cold winters (NCC climate zones 4, 7 and 8),\nnoting that blanket and foil will provide greater protection,\n\n‘Ventilation of the roof cavity may assist with removing moisture in the roof space. Minimal\n“trickle” ventilation is usually all that is required. Natural ventilation of roofs allowing air\nin at the eave or soffit and out at the ridge is often suitable for roofs with larger cavities,\nhowever, supplementary venting may be required where the roof cavity is made relatively\nair-tight including the need for greater condensation protection measures for very low pitch\nskillion roofs.\n\nUninsulated steel roof systems may be unsuitable for farm buildings used for intensive\nhusbandry of animals. These buildings, because of their occupation and purpose, may\ncontain air of a high relative humidity together with high concentrations of ammonia and\norganic acids. When these occur in the water condensed on the underside of the roof, rapid\ncorrosion will occur.\n\nIn buildings without ceilings, such as factories, condensate may fall on the machinery or\nstock in the space below and consideration should be given to the inclusion of insulation\nbeneath the metal deck roof to reduce this risk.\nNOTES:\n1 The information above may not be applicable to the tropics or homes that are built to meet\nbushfire requirements.\n\nsensed to Intertek Inform for All Roof Take-offs,\n\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\n2 Specialist advice should be sought for special purpose buildings, such as where high humidity\nmay exist, e.g. swimming pools or where high levels of environmental control are required,\ne.g. museums.\n\n3. Use of vapour permeable membranes beneath metal roofing are not commonly used in\nAustralia and expert guidance should be sought. The use of these membranes as an underlay\nbeneath metal roofing are common in New Zealand and work because of their installation\npractice and requirement for vapour permeability and absorptivity.\n\nCopyrighted material\n\n4 Condensation can occur for buildings that lock up moisture or water during construction that\nis subsequently unable to dry. Care should be taken to ensure that the building can dry and\nreach equilibrium prior to locking it up.\n\nwww standards.org.au @ Standards Australia",
    "book_page": "25",
    "comment_for_internal_use_": ""
  },
  {
    "page": 28,
    "text": "Copyrighted material licensed to Intertek Inform for All Roof Take-offs.\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\n© Standards Australia\n\nAS 1562.1:2018 26\n\nAPPENDIX B\nWATER PENETRATION\n(Informative)\n\nBl WATER PENETRATION\n\nCorrect installation of cladding and flashings will minimize water entry through the\nbuilding envelope. Water may penetrate the building envelope where flashings are not\nproperly installed (e.g. flashings that do not allow drainage from all pans or troughs in the\ncladding, or are inadequately fixed or inadequately overlapped with cladding). See\nClauses 4.7 and 4.8.\n\nWind in severe storms may cause the following effects:\n\n(a) Water may be driven up roof surfaces at or above the minimum pitch so that roofs do\nnot drain properly.\n\n(b) Differential pressure across the building envelope can force air that may have water\nentrained in it under flashings.\n\nConsideration in determining the extent of wind-driven rainwater ingress should be given\nto—\n\n(i) the length and pitch of the roof,\n(ii) _ the profile of the cladding and its water channel drainage capacity;\n(iii) _ the risk of ponding in the case of a low pitch roof;\n\n(iv) the potential penetration of water through end and side laps;\n\n(v) number of penetrations through cladding;\n\n(vi) complexity of flashings;\n\n(vii) size and pitch of valley gutters;\n\n(viii) length of lap of flashing over the sheeting; and\n\n(ix) overlap of adjoining flashing sections.\n\nB2 MINIMIZING WATER PENETRATION\n\nThe following references offer advice on installing flashings and reducing water penetration\nin cladding systems:\n\n(a) SAHB39.\n\n(b) NZ Acceptable Solution E2/AS1\n\n(c) NZ Metal Roof and Wall Cladding Code of Practice.\n\nTo provide an effective seal against wind-driven rain, most flashings should also be\ndesigned to protect against upward-moving water. This is particularly the case for flashings\nat the top of roof surfaces such as valley gutters, ridges or apron flashings. The gap between\nthe cladding and these flashings may also be sealed with closed-cell foam strips. Such strips\nneed to be anchored in position to resist wind pressures. Turned up edges of roofing and\nhems and hooks on flashings are required to achieve weatherproofing and also anchor the\nfoam strips.\n\nValley gutters should incorporate upstands or weather hooks on edges and tops. Closed cell\nfoam at the top of valley gutters will reduce the overtopping as wind drives water up the\nroof pitch (i.e. slope).\n\nwww standards.org.au",
    "book_page": "26",
    "comment_for_internal_use_": ""
  },
  {
    "page": 29,
    "text": "21 AS 1562.1:2018\n\nAPPENDIX C\nMATERIAL PROPERTIES\n\n(Informative)\n\nTable C1 provides guidance on coefficients for linear expansion of several materials.\nTables C2, C3 and C4 provide information on suitability of materials in direct contact or\nmoisture path from one surface to the next\n\nTABLE C1\n\nTYPICAL COEFFICIENT\nOF LINEAR EXPANSION\n\nBase materiat | Co*fficient of linear expansion\n\nwy\n‘Aluminium 24x 10-6\nCopper 17x 10-6\nSteel 12x 106\n\nStainless steel\nZine\n\n‘NOTE: Coefficient of linear expansion may be dependent\n‘on the metallurgy of the base material\n\nsensed to Intertek Inform for All Roof Take-offs.\n\nNo further reproduction or distribution permitted, Printed / viewed by:allrooftakeofis@gmail.com @ 29/06/2025\n\nTABLE C2\nCORROSION ZONES COMPARED TO EARLIER VERSIONS OF AS/NZS 2312\n= tegory my 2002 1994 an\nA co [wyew fas [a = =\nE 2 Low 1.3.25 B Mild Mild—rural arid\nL\n2 Mildura\ne\n& industrial\ng\nwaite | Neyer\nCau [very nism Paavo eae aie Wey vee\n\nNOTE: This Table is based on Table D1, Appendix D, of AS 4312\n\nwww standards.org.au @ Standards Australia",
    "book_page": "27",
    "comment_for_internal_use_": ""
  },
  {
    "page": 30,
    "text": "eyeasny sprepueis\n\nne-6vo'spuepues mma\n\nTABLE C3\nACCEPTABILITY OF DIRECT CONTACT BETWEEN METALS OR ALLOYS\n\n[Accessory or fastener material\n\nAluminium/zine and\nCopper and copper | Stainless stect_ | Zinc-coated steel | alumi\n\naluminium alloys alloys (300 series) and zine ‘magnesium alloy-\ncoated steet\n\nZinc-tin (20-30 %)\nLead mechanically plated\n\n(Cladding mater\n\njum/zine\n\nAtmospheric classifica\n\nStanavs] mia [stanavs| mia [stanavs] ma [si\n\navs] Mua [Stand vs Stand vs | Mua [Stanavs| mia\n\nAluminium and ver | Yes No No noe | ves | vest | vest | ves Yes No No Yes Yes\naluminium alloys\n\nCopper and copper alloys | _No No ves_| ves No Yes No No No No No Yes No No\nStainless stec! No No No No ver | Yes No No No No Yes No No\n(600 series)\n\nZinc-coated steel and zinc| Yes | Yes No No No ves | ves | ves | ver Yes No Yes Yes Yes\nAluminium/zine and yes | Yes No No No a en en No No Yes Yes\n\n‘luminium/zine\n\n‘magnesium alloy-coated\nsteel\n\nGrade 316 may be suitable\n+ Zinc-coated steel and zinc\nLEGEND:\n\n© suitable for diet contact, but are not suitable if drainage from an aluminium oF aluminium alloy roof passes over the fastener or accessory.\n\nSI, VS, Mild = severe industrial, very severe and mild classifications (refer to Table C2 for comparable climatic zone classifications)\nYes acceptable combination of metals\n\nNo not acceptable combination of metals\n\nNOTES:\n\n1 “Acceptable” and ‘not acceptable” imply the following:\n\nsion. It also implies that the\n\n() Acceptable As a result of bimetallic contact, either no additional cor\ndegree of corrosion would not significantly shorten the service life\n\nsion of the cladding system will take place or, atthe worst, slight additional cor\n\n(©) Not acceptable Moderate to severe corrosion of the cladding or accessories will occur, a condition which may result ina significant reduction in the service life\n\nUnless separation can be ensured, prepainted cladding materials should be considered in terms of the base material\n\n9ST SV\n\nsoz:\n\nav",
    "book_page": "28",
    "comment_for_internal_use_": "Table is 100% accurate, Confirm if the text part is required or not, or if changes are needed",
    "tables": 
    {  "Table C3": {
                  "Aluminium and aluminium alloys": {
                    "Aluminium and aluminium alloys": { "SI and VS": "Yes", "Mild": "Yes" },
                    "Copper and copper alloys": { "SI and VS": "No", "Mild": "No" },
                    "Stainless steel (300 series)": { "SI and VS": "No*", "Mild": "Yes" },
                    "Zinc-coated steel and zinc": { "SI and VS": "Yes†", "Mild": "Yes†" },
                    "Aluminium/zinc and aluminium/zinc magnesium alloy-coated steel": { "SI and VS": "Yes", "Mild": "Yes" },
                    "Lead": { "SI and VS": "No", "Mild": "No" },
                    "Zinc–tin (20–30%) mechanically plated steel": { "SI and VS": "Yes", "Mild": "Yes" }
                  },
                  "Copper and copper alloys": {
                    "Aluminium and aluminium alloys": { "SI and VS": "No", "Mild": "No" },
                    "Copper and copper alloys": { "SI and VS": "Yes", "Mild": "Yes" },
                    "Stainless steel (300 series)": { "SI and VS": "No", "Mild": "Yes" },
                    "Zinc-coated steel and zinc": { "SI and VS": "No", "Mild": "No" },
                    "Aluminium/zinc and aluminium/zinc magnesium alloy-coated steel": { "SI and VS": "No", "Mild": "No" },
                    "Lead": { "SI and VS": "No", "Mild": "Yes" },
                    "Zinc–tin (20–30%) mechanically plated steel": { "SI and VS": "No", "Mild": "No" }
                  },
                  "Stainless steel (300 series)": {
                    "Aluminium and aluminium alloys": { "SI and VS": "No", "Mild": "No" },
                    "Copper and copper alloys": { "SI and VS": "No", "Mild": "No" },
                    "Stainless steel (300 series)": { "SI and VS": "Yes", "Mild": "Yes" },
                    "Zinc-coated steel and zinc": { "SI and VS": "No", "Mild": "No" },
                    "Aluminium/zinc and aluminium/zinc magnesium alloy-coated steel": { "SI and VS": "No", "Mild": "No" },
                    "Lead": { "SI and VS": "No", "Mild": "Yes" },
                    "Zinc–tin (20–30%) mechanically plated steel": { "SI and VS": "No", "Mild": "No" }
                  },
                  "Zinc-coated steel and zinc": {
                    "Aluminium and aluminium alloys": { "SI and VS": "Yes", "Mild": "Yes" },
                    "Copper and copper alloys": { "SI and VS": "No", "Mild": "No" },
                    "Stainless steel (300 series)": { "SI and VS": "No", "Mild": "Yes" },
                    "Zinc-coated steel and zinc": { "SI and VS": "Yes", "Mild": "Yes" },
                    "Aluminium/zinc and aluminium/zinc magnesium alloy-coated steel": { "SI and VS": "Yes", "Mild": "Yes" },
                    "Lead": { "SI and VS": "No", "Mild": "Yes" },
                    "Zinc–tin (20–30%) mechanically plated steel": { "SI and VS": "Yes", "Mild": "Yes" }
                  },
                  "Aluminium/zinc and aluminium/zinc magnesium alloy-coated steel": {
                    "Aluminium and aluminium alloys": { "SI and VS": "Yes", "Mild": "Yes" },
                    "Copper and copper alloys": { "SI and VS": "No", "Mild": "No" },
                    "Stainless steel (300 series)": { "SI and VS": "No", "Mild": "Yes" },
                    "Zinc-coated steel and zinc": { "SI and VS": "Yes", "Mild": "Yes" },
                    "Aluminium/zinc and aluminium/zinc magnesium alloy-coated steel": { "SI and VS": "Yes", "Mild": "Yes" },
                    "Lead": { "SI and VS": "No", "Mild": "No" },
                    "Zinc–tin (20–30%) mechanically plated steel": { "SI and VS": "Yes", "Mild": "Yes" }
                  }
                },
                "legend": {
                  "*": "Grade 316 may be suitable.",
                  "†": "Zinc-coated steel and zinc are suitable for direct contact, but are not suitable if drainage from an aluminium or aluminium alloy roof passes over the fastener or accessory.",
                  "SI and VS": "Severe Industrial and Very Severe classifications (refer to Table C2).",
                  "Mild": "Mild atmospheric classification.",
                  "Yes": "✅ Acceptable combination of metals.",
                  "No": "⚠️ Not acceptable combination of metals."
                },
                "notes": [
                  "1. ‘Acceptable’ and ‘Not acceptable’ imply the following:",
                  "   (a) Acceptable — As a result of bimetallic contact, either no additional corrosion of the cladding system will take place or, at the worst, slight additional corrosion. It also implies that the degree of corrosion would not significantly shorten the service life.",
                  "   (b) Not acceptable — Moderate to severe corrosion of the cladding or accessories will occur, a condition which may result in a significant reduction in the service life.",
                  "2. Unless separation can be ensured, prepainted cladding materials should be considered in terms of the base material."
                ]
              }
  },
  {
    "page": 31,
    "text": "com @ 29/05/2025\n\nRoof Take-offs,\n\nCopyrighted material licensed to Intertek Inform for\n\n2\ng\ng\nH\n3\ng\n$\nz\n7\n3\nE\na\n5\nz\n3\n8\n&\n3\ns\n\nTABLE C4\n\nACCEPTABILITY OF DRAINAGE FROM ONE SURFACE\nTO A LOWER METAL OR ALLOY SURFACE\n\nAS 1562.1:2018\n\nLower eladding/aceessory materials\n\ntrzersaang’, Anion Came | sustes | Ze, | Memes |\ngta | gamer [ons [sa] mat,\n\n* Whilst drainage between the materials shown would be acceptable, direct material contact should be\n\navoided (see Table C3).\nLEGEND:\n\nYes = acceptable combination of metals\nNo = not acceptable combination of metals\n\nNOTE: “Acceptable” and ‘not acceptable” imply similar service performances to those noted in Table C3.\n\nwww standards.org.au\n\n© Stan\n\ndards Australia",
    "book_page": "29",
    "comment_for_internal_use_": "Check entire table accuracy, Confirm if the text part is required or not, or if changes are needed",
    "title": "Acceptability of drainage from one surface to a lower metal or alloy surface.",
    "tables": 
    { "Table C4":[
              {
                "Metal A": "Copper",
                "Aluminium": "No*",
                "Zinc": "No*",
                "Steel (Galv)": "No*",
                "Zinc-Alum": "No*",
                "Stainless Steel": "Yes",
                "Lead": "Yes",
                "notes": {
                  "Aluminium": "Drainage allowed, avoid direct contact",
                  "Zinc": "Drainage allowed, avoid direct contact",
                  "Steel (Galv)": "Drainage allowed, avoid direct contact",
                  "Zinc-Alum": "Drainage allowed, avoid direct contact"
                }
              },
              {
                "Metal A": "Aluminium",
                "Aluminium": "Yes",
                "Zinc": "Yes",
                "Steel (Galv)": "Yes",
                "Zinc-Alum": "Yes",
                "Stainless Steel": "Yes",
                "Lead": "Yes",
                "notes": {}
              },
              {
                "Metal A": "Zinc",
                "Aluminium": "Yes",
                "Zinc": "Yes",
                "Steel (Galv)": "Yes",
                "Zinc-Alum": "Yes",
                "Stainless Steel": "Yes",
                "Lead": "Yes",
                "notes": {}
              },
              {
                "Metal A": "Steel (Galv)",
                "Aluminium": "Yes",
                "Zinc": "Yes",
                "Steel (Galv)": "Yes",
                "Zinc-Alum": "Yes",
                "Stainless Steel": "Yes",
                "Lead": "Yes",
                "notes": {}
              },
              {
                "Metal A": "Zinc-Alum",
                "Aluminium": "Yes",
                "Zinc": "Yes",
                "Steel (Galv)": "Yes",
                "Zinc-Alum": "Yes",
                "Stainless Steel": "Yes",
                "Lead": "Yes",
                "notes": {}
              },
              {
                "Metal A": "Stainless Steel",
                "Aluminium": "Yes",
                "Zinc": "Yes",
                "Steel (Galv)": "Yes",
                "Zinc-Alum": "Yes",
                "Stainless Steel": "Yes",
                "Lead": "Yes",
                "notes": {}
              },
              {
                "Metal A": "Lead",
                "Aluminium": "Yes",
                "Zinc": "Yes",
                "Steel (Galv)": "Yes",
                "Zinc-Alum": "Yes",
                "Stainless Steel": "Yes",
                "Lead": "Yes",
                "notes": {}
      }]
    }
  },
  {
    "page": 32,
    "text": "Copyrighted material licensed to Intertek Inform for All Roof Take-offs.\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\n© Standards Australia\n\nAS 1562.1:2018 30\n\nAPPENDIX D\nROOF PITCH CALCULATION FOR WATER DRAINAGE\n\n(Normative)\nFor closely spaced rib roofing profiles, the minimum required pitch angle (@) shall be\ndetermined from the following equations:\n\nna! = (10.44 AR)\" mm? DI\n\nRoofing profiles shall be treated as closely spaced rib profiles if ratio w'/D does not exceed\n2.5 as shown in Figure D1, where w\" is trough or valley width as measured at profile\nmiddepth D/2 as shown in Figure D1.\n\nD=rib depth\nFor all other roofing profiles, the minimum required pitch angle (6) shall be determined\nfrom the following equatio\n\n[288 4R nT mm? eeu\n\nna’\n\nwhere\n\nn=05 +3.507sin(0) + /0.25+3.507,/sin(0) ; or D3\n(ay Bs\n\nsin(a)=|\n\nwidth of the top surface of water in valley or trough, in millimetres (see\nFigure D1)\n\ncatchment area, in metres square\n\n= Ixm\nR = rainfall intensity, in millimetres per hour\n1 = length of catchment area\n= total roof pitch length, in metres\nm = width of roofing module, in metres (see Figure D1)\n\n= centre to centre spacing of ribs in sheeting\n\ncross-sectional area of water in roofing module (valley or trough), in\nmillimetres square (see Figure D1)\n\nn = pitch factor within limits 1 and 4\n\nNOTE: Where <1 use minimum piteh for the roofing profile from Table 3.1 or if > 4, roof\npitch is higher than 20° and would require other means of verification such as testing.\n\n8 = roof pitch angle, in degrees\nThe depth of water (dm) in a valley or trough of a profile shall be taken as follows:\n(a) Where an anti-capillary feature is provided (see Figure D2):\n\ndy, = 0.6h, for closely spaced rib profiles\n\ndy = 0.75hs for all other profiles\n\nwww standards.org.au",
    "book_page": "30",
    "comment_for_internal_use_": ""
  },

    {
    "page": 33,
    "text": "31 AS 1562.1:2018\n\ndq = maximum depth of water, in millimetres (see Figure D1)\n\nhy = distance from the bottom surface of a profile to the top of a capillary feature,\nmillimetres (see Figure D2)\n\n(b) Where the anti-capillary feature is not provided (see Figure D1):\ndy = 0.75hot\nwhere\n\nhgi= distance from the bottom surface of a profile to the overlap lip, in millimetres\n(see Figure D1)\n\nThe anti-capillary feature shall meet the following requirements:\n\n(i) The anti-capillary feature shall be positioned on the overlap lip side of the roofing\nside lap.\n\n(ii) The anti-capillary feature shall be between the mating surfaces of the lapping ribs.\n\n(iii) ‘The anti-capillary feature shall provide a minimum separation of 1 mm.\n\nRoof Take-offs,\noftakeo ffs @gmail\n\n(iv) The anti-capillary feature shall not be compromised by installation practices such as\nover-tightening of crest fasteners.\n\n5\n: If any one parameter (i) to (iv) above is not met, the profile shall be deemed as not having\ns an anti-capillary feature.\n2\n2\n2\n3\n5 t\n8 D\nt\n\nFIGURE D1 ROOFING PROFILE WITH NO ANTI-CAPILLARY FEATURE\n\nt\n4, h\nSN —, r_\\\n\nFIGURE D2 ROOFING PROFILES WITH ANTI-CAPILLARY FEATURE\n\nCopyrighted material\nNo further reproduction or distribution permitted. Printed / viewed by:al\n\nwww standards.org.au @ Standards Australia",
    "book_page": "31",
    "comment_for_internal_use_": ""
  },
  {
    "page": 34,
    "text": "Copyrighted material licensed to Intertek Inform for All Roof Take-offs.\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\n© Standards Australia\n\nAS 1562.1:2018 2\n\nAPPENDIX E\nBRACING\n\n(Informative)\n\nCladding can be an integral part of wall/roof shear diaphragms, contributing to the strength\nand stiffness of buildings. The structural performance of the sheeting system in shear\ndiaphragms is not covered in this Standard.\n\nThe bracing behaviour should be evaluated by testing—\n(a) _ in steel frame buildings using AS/NZS 4600; or\n(b) _ in timber frame buildings using ISO 19049 or TR 440.\n\n‘As cladding is simultaneously subjected to out-of-plane and diaphragm loads, where\nbracing resistance is required from the cladding system, allowance should be made for the\ninteraction between the sheeting capacity under the two loading directions. The interaction\nmay be different for non-cyclonic wind loads and cyclonic wind loads. Where the maximum.\nshear stress due to diaphragm action does not exceed 25% of the maximum bending stress,\nit is anticipated that interaction is negligible.\n\nwww standards.org.au",
    "book_page": "32",
    "comment_for_internal_use_": ""
  },
  {
    "page": 35,
    "text": "Copyrighted material licensed to Intertek Inform for All Roof Take-offs.\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\nwww standards.org.au\n\n3 AS 1562.1:2018\n\nBIBLIOGRAPHY\nInformative references\n\n‘The following are the informative documents referenced in this Standard:\n\nAS\n2312 Guide to the protection of iron and steel against exterior atmospheric corrosion\n2312.1 Part 1: Paint coatings\n\n4600 Cold formed steel structures\n\n4312 Atmospheric corrosivity zones in Australia\n\nIso\n\n19049 Timber structures—Test method—Static load tests for horizontal diaphragms\n\nincluding floors and roofs\n\nEN\n\n1993-1-3. Eurocode 3—Design of steel _structures—Parts 1-3: General rules—\nSupplementary rules for cold-formed members and sheeting\n\nHB 39 _ Installation code for metal roof and wall cladding (2015), Standards Australia\n\nCyclone Testing Station (2009) Guide to the Low-High-Low eyelic testing, Cyclone Testing\nStation, James Cook University, Queensland\n\nNZ Acceptable Solution E2/AS1 (2011), New Zealand Ministry of Business Innovation and\nEmployment\n\nNZ Metal Roof and Wall Cladding Code of Practice (2012), New Zealand Metal Roofing\nManufacturers Inc\n\nTR 440 (1978) ‘Guidelines for the testing and evaluation of products for cyclone-prone\nareas’, Experimental Building Station, Australian Government Department of Construction\n\nMartin K.G, Roof Drainage, Commonwealth Scientific and Industrial Research\nOrganisation, Australia, 1978\n\n© Standards Australia",
    "book_page": "33",
    "comment_for_internal_use_": ""
  },
  {
    "page": 36,
    "text": "AS 1562.1:2018\n\nNOTES\n\nUBD soa eyo} |2:Aq PAMeIA / Aiud \"PSN\n'SYO-2} | JOY ly 40} WO} YOHSIUT O} pasts\n\nLed UonNglas|p 40 uononpouded JeyLNY ON,\nleverew payysucdoo",
    "book_page": "34",
    "comment_for_internal_use_": ""
  },
  {
    "page": 37,
    "text": "AS 1562.1:2018\n\n3s\n\nNOTES\n\nszoziso16z © wos\n\nJeWUBD)sj 002}\n‘50-28 | JOY\n\nAq pamelA / peiulie ‘pentuied uoNNgLsip Jo uononpoxdes JoULN) ON,\nJ0} WO}U HeWaRU O} pasuEd|| jeUETEW PayBUAdoD",
    "book_page": "35",
    "comment_for_internal_use_": ""
  },
  {
    "page": 38,
    "text": "36\n\nAS 1562.1:2018\n\nNOTES\n\nUBD soa eyo} |2:Aq PAMeIA / Aiud \"PSN\n'SYO-2} | JOY ly 40} WO} YOHSIUT O} pasts\n\nLed UonNglas|p 40 uononpouded JeyLNY ON,\nleverew payysucdoo",
    "book_page": "36",
    "comment_for_internal_use_": ""
  },
  {
    "page": 39,
    "text": "Copyrighted material licensed to Intertek Inform for All Roof Take-offs.\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\nStandards Australia,\n\n‘Standards Australia develops Australian Standards® and other documents of public benefit and national interest\n‘These Standards are developed through an open process of consultation and consensus, in which all interested\nparties are invited to partcipate. Through a Memorandum of Understanding with the Commonweatth Government,\nStandards Australia is recognized as Australia's peak non-government national standards body.\n\nFor further information visit www. standards.org.au\n\nAustralian Standards®\n\nCommittees of experts from industry, governments, consumers and other relevant sectors prepare Australian\n‘Standards. The requirements or recommendations contained in published Standards are a consensus ofthe views.\nof representative interests and also take account of comments received from other sources. They reflect the latest\n‘scientific and industry experience. Australian Standards are kept under continuous review after publication and are\nUpdated regularly to take account of changing technology.\n\nInternational Involvement\n\n‘Standards Australia is responsible for ensuring the Australian viewpoint is considered in the formulation of\nInternational Standards and that the latest international experience is incorporated in national Standards. This role is\nvital in assisting local industry to compete in international markets. Standards Australia represents Australia at both\nthe International Organization for Standardization (ISO) and the Intemational Electrotechnical Commission (IEC).",
    "book_page": "Cover Back 1",
    "comment_for_internal_use_": ""
  },
  {
    "page": 40,
    "text": "‘Standards Australia Limited\nGPO Box 476\n\nPhone: 02 9237 6000\n\nEmail: mail@standards.org.au\nInternet: www.standards.org.au\n\nSydney NSW 2001\n\nszoziso16z © wos\n\nJeWUBD)sj 002}\n‘50-28 | JOY\n\nAq pamelA / peiulie ‘pentuied uoNNgLsip Jo uononpoxdes JoULN) ON,\nJ0} WO}U HeWaRU O} pasuEd|| jeUETEW PayBUAdoD\n\nISBN 978 1 76072 008 7",
    "book_page": "Cover Back 2",
    "comment_for_internal_use_": ""
  }
]