[
  {
    "page": 21,
    "text": "19 AS 1562.12\n\n4.8.3. Fastening\n\nAll exposed parts of flashings shall be fastened in accordance with Table 4.2 using\nself-drilling screws. Where the total area is less than 0.25 m*, blind rivets may be used on\nflashings.\nBarge capping shall be fastened on upper and side surfaces.\nNOTE: Many flashings are near or on the edges of the buildings and, therefore, are subjected to\n‘more severe wind pressures than the main body of the roof. They need to be securely fixed to the\nstructure where possible and elsewhere to the cladding.\n\nTABLE 4.2\nFASTENER SPACING FOR FLASHINGS AND CAPPINGS\n\nFlashing type Fastener spacing\nNon-cyclonie wind regions | Cyclonic wind regions\n‘Transverse flashing edge (at an angle to the ribs [At not more than 310 mm | At not more than 310 mm.\nor profile greater than 5°) centres centres\nLongitudinal flashing edge along cladding (at | At not more than the At not more than S00 mm\naan angle less than or equal to 5°) batten/purlin/gict spacing [centres along the cladding\nFlashing edge to material other than metal At the same or less spacing | At not more than 500 mm\ncladding (eg. barge flashing edge fixed to as the fastener spacing on [centres\nconerete wall) the other flashing surface\n(e.g. roof oF wall cladding)\n\nNOTES:\n1 This Table is based on HB 39, Table 8.2(B).\n\n2 Minimum fixing distances are appropriate for flashings of thicknesses presented in Table 4.1\n3. End laps of flashings and eappings may be joined with blind rivets.\n\n3\ng\ns\n3\n@\nz\n5\nE\n2\nz\n2\n2\n2\n3\n5\n\nCopyrighted material\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\nwww standards.org.au @ Standards Australia"
  },
  {
    "page": 22,
    "text": "AS 1562.1:2018 20\n\nSECTION 5 TESTING\n\n5.1 GENERAL\n\nTesting is required to demonstrate the conformance of the cladding system with the\nrequirements of this Standard.\n\nNOTES:\n\n1 While testing of accessories is not included in the Standard, pressures and loads and the\nprovisions of this Standard may be used to verify the performance of accessories.\n\n2 By way of example, accreditation bodies which are signatories to the International Laboratory\nAccreditation Cooperation (ILAC) Mutual Recognition Arrangement (MRA) for testing\nlaboratories may be able to offer accreditation against the requirements of\nAS ISO/IEC 17025. A listing of ILAC signatories is available from the ILAC website\n(www.ilac.org). In Australia and New Zealand, the National Association of Testing\nAuthorities (NATA) and International Accreditation New Zealand (IANZ) are signatories to\nthe ILAC MRA.\n\n5.2. TEST SPECIMEN\n\nTest specimens shall be fabricated as full-size assemblies of the documented cladding\nsystem as defined in Clause 3.5.\n\nThe cladding system shall be fully documented in the test report, listing all of the\nparameters in Clause 3.5, including design loads and pressures that are used as the basis of\nthese tests.\n\nThe fabrication of the test specimen in the test rig shall not affect the capacity or failure\nmodes of the system (for example, at boundary conditions of the specimen such as end\nsupports and free edges).\n\nsensed to Intertek Inform for All Roof Take-offs,\n\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\n5.3. DERIVATION OF DESIGN VALUES\n5.3.1 Serviceability test pressure\n\nThe reported test serviceability pressure (P,,) shall be the minimum test pressure (Pismia) at\nserviceability limit as per Clause 5.5.1 and Clause 5.6.2 for all the tests of the same span\nconfigurations and length, on the same profile, material and thickness.\n\n5.3.2. Ultimate test pressure\n\nCopyrighted material\n\nThe reported test ultimate pressure (Pj) shall be the minimum ultimate pressure (Panis)\nthat can be sustained for all the tests of the same span configurations and length on the\nsame profile, material and thickness.\n\n5.3.3. Serviceability design pressure\n\nDesign value for serviceability (Pa.) shall satisfy:\n\n533\n\n‘a sampling factor, which is a function of the number of tests N and the\ncoefficient of variation of structural characteristics V,: as given in Table 5.1\n\nPy = serviceability pressure\n\n© Standards Australia www standards.org.au"
  },
  {
    "page": 23,
    "text": "Copyrighted material licensed to Intertek Inform for All Roof Take-offs.\n\nNo further reproduction or distribution permitted, Printed / viewed by:allrooftakeoffs @gm:\n\ng\nra\nS\ng&\ni)\n§\n\n5.3.4 Ultimate design pressure\n\nDesign value for strength (P,,) shall satisfy the following:\n\nPus\nNOTES:\n\nAS 1562.1:2018\n\n53.4\n\na sampling factor which is a function of the number of tests N and the\ncoefficient of variation of structural characteristics Vsc as given in Table 5.1\n\nult\n\nate pressure\n\n1 Strength tests are based on ultimate limit states loads.\n\n2 Deflection tests are based on serviceability limit states loads.\n\nwww standards.org.au\n\nTABLE 5.1\n\nFACTORS TO ALLOW FOR VARIABILITY\nOF STRUCTURAL UNITS (k,)\n\nNo. of units to] Coefficient of variation of structural characteristics\nbe tested 2)\n” 3% 10% 15% 20%\n1 120 1.46 179) 221\n2 Lay 138 Led 1.96\n3 Las 133 156 183\n4 Lis 130 130 74\n5 LB 128 146 1.67\n10 Lio 121 134 149\n20 1.06 113 121 129\n100 101 Lol Low Lot\nNOTES:\n\n1 Where tests evaluate deflection under serviceability limit states loads, a\ncoefficient of 5% may be assumed unless there is evidence showing that\n‘a higher figure is warranted.\n\n‘A coefficient of variation of 10% may be assumed for strength of metal\ncladdings and metal supporting systems unless there is evidence\nshowing that a higher figure is warranted.\n\n3. A coefficient of variation of 20% should be assumed for connection sub-\nassemblies unless there is evidence showing that a different figure is\nwarranted.\n\n4 Higher coefficients of variation for serviceability, strength of cladding\nland strength of connections may be expected if a compliant material\n(e.g. coll) is to be sourced from more than one supplier subsequent to the\ntesting program,\n\nInterpolation is allowed in Table 5.1 within the same category (Vi).\nGuidance on determining the number of units to be tested is available in\nGuide to the Low-High-Low eyelic testing by the Cyclone Testing\nStation.\n\n7 This Table based on Table BI of AS/NZS 1170.0 and Table 8.2.3 of\nAS 4600\n\n© Standards Australia"
  },
  {
    "page": 24,
    "text": "AS 1562.1:2018 2\n\n5.4 RESISTANCE TO CONCENTRATED LOADS\n5.4.1 General\n\nThe test requirements of this Clause apply only to roof claddings that support loads as\ndefined in Clause 3.2.2(a) (Cladding providing direct support). Testing shall be performed\nin accordance with AS 4040.1\n\n5.4.2. Serviceabi\n\ntest\n\nFor any part of the path specified by the sheeting manufacturer (see Clause 3.2.2) subjected\nto a concentrated test load for serviceability limit state by the method described in\nAS 4040.1, no de-indexing, unclipping, permanent local deformation, fracture or failure of\nany part of the cladding or failure of the fastening shall occur. The residual deflection\ndirectly under the point of application of the load within a maximum of 5 min after removal\nof the load shall not exceed S/1000 or 1.5 mm, whatever is higher.\n\nThe concentrated load shall be applied to those parts of the cladding that will produce\n‘maximum deflection and maximum permanent deformation.\n\nNOTES:\n\n1 Limits on residual deflection have been included to preserve the appearance of the sheeting\nand to reduce ponding. Residual deflection is normally measured after light tapping of the\nsheeting to settle the sheeting to its rest position.\n\n2 The location of maximum deflection may not necessarily coincide with the position of\nmaximum deformation. When testing for maximum permanent deformation, consideration\nshould be given to the application of the concentrated load directly over a supporting member\nor between sidelap fasteners.\n\n5.4.3 Strength test\n\nWhen any part of the cladding is subjected, for not less than 1 min, to a concentrated test\nload for strength limit state in accordance with AS 4040.1, the load shall be sustained,\nirrespective of any permanent deformation that may occur.\n\nS\ng\ns\n3\n@\nz\n5\nE\n2\nz\n2\n2\n2\n3\n5\n\n5.5 RESISTANCE TO WIND PRESSURES FOR NON-CYCLONE REGIONS\n5.5.1 Serviceability test\n\nFor the cladding system subjected to the test pressure for serviceability limit state in\naccordance with AS 4040.2, the maximum deflection of the cladding relative to the\nsupporting members shall not exceed (5/120 + p/30) except for overhangs where maximum.\ndeflection shall not exceed $/60 + p/30, no de-indexing, unclipping, permanent local\ndeformation, or fracture or failure of any part of the sheeting or of the fastenings shall\noccur, and the residual deflection, 1 min after the removal of the pressure, shall not exceed\n‘5/1000 or 1.5 mm, whichever is higher.\n\nNOTE: See also Note | to Clause 5.4.2.\n\n5.5.2 Strength test\n\nThe cladding system shall be subjected to the test pressure for strength limit state for\nnon-cyclone regions in accordance with AS 4040.2. The pressure shall be sustained and\nwith no failure of fasteners and all parts of the cladding system shall remain in position,\nnotwithstanding any permanent distortion that may occur in the sheeting and fastenings.\n\nCopyrighted material\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\nNOTE: ‘Remain in position’ means that the cladding has not disengaged or separated from any\nfastener/clip/bracket/tongue or along the side laps of the test specimen.\n\n© Standards Australia www standards.org.au"
  },
  {
    "page": 25,
    "text": "Copyrighted material licensed to Intertek Inform for All Roof Take-offs.\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\nwww standards.org.au\n\n2a AS 1562.1:2018\n\n5.6 RESISTANCE TO WIND PRESSURES FOR CYCLONE REGIONS\n5.6.1 General\n\nCladding systems to be used in cyclone regions shall be tested for their capacity to resist\n\nlow-cycle fatigue loading. These test requirements shall apply to cladding for both roofs\n\nand walls. Testing shall be performed in accordance with AS 4040.3.\nNOTE: It is important to differentiate between cyclic fatigue failure, associated with\ndisengagement of cladding from its supports after repeated load applications, and static failure\nwhich is associated with a strength capacity of a cladding system. Low cycle fatigue cracking of\ncladding, fixings, immediate supports and their fixings during tropical cyclones is a complex\nprocess where small changes in load, geometry or material properties can significantly affect the\nfatigue performance of the system. At present, there is no way to assess this type of performance\napart from testing,\n\n5.6.2. Serviceabi\n\ntest\n\nThe serviceability test for resistance to wind pressure for cyclone regions shall be as\nspecified in Clause 5.5.1\n\n5.6.3 Strength test\n\nThe cladding system shall be subjected to the sequence of fatigue loading for cyclone\nregions specified in AS 4040.3, and shall have no failure of fasteners and remain in\nposition, notwithstanding any permanent distortion, cracks or tears that may occur in the\nsheeting and fastenings.\nNOTE: ‘Remain in position’ means that the cladding has not disengaged or separated from any\nfastener/clip/bracket/tongue or along the side laps of the test specimen\n\n© Standards Australia"
  },
  {
    "page": 26,
    "text": "AS 1562.1:2018 4\n\nAPPENDIX A\nROOF VENTILATION, WATER VAPOUR AND CONDENSATION\n\n(Informative)\n\nAl CAUSES OF CONDENSATION\n\nAll air contains some moisture in the form of water vapour, the amount of which depends\non the local environment. The amount of water vapour that the air can hold is a function of\nits temperature. As air cools, its ability to hold water vapour reduces until such point that it\nis unable to retain water vapour and the excess moisture is released as dew, which is\nreferred to as its dew point temperature. Condensation is the term used to describe moisture\nformation on a surface as a result of air coming into contact with a surface below its dew\npoint temperature. Moisture formed from condensation is referred to as condensate.\n\nAir inside a roof cavity will contain moisture from outdoor air and moisture generated by\nthe activities in the building. Substantial quantities of moisture can be generated from\nactivities within a building such as cooking, washing dishes and clothes, drying clothes\nindoors, combustion heating, showering and bathing, perspiration and the breathing of\noccupants and plants. Moisture can also be generated from other sources such as building\nwater leaks through pipes or unprotected ground moisture. Persistent high levels of\nmoisture in the roof cavity may cause problem condensation.\n\nA2_ ROOF CONDENSATION\n\nThe roof is the most exposed element of the building fabric. On clear still nights the roof,\ntemperature often drops below the outdoor air temperature as it loses heat via radiation to\nthe cold night sky. The cold roof combined with the moisture generated at times within\nhomes makes overnight condensation within roofs likely; however, condensate is also likely\nto dry during the day due to high roof and roof space temperatures. While it is good practice\nto minimize the risk of condensation, significant problems will usually only eventuate if\ncondensation is persistent or condensate becomes trapped. Generally, the risk of persistent\ncondensation in roofs is greatest in the coolest climate zones (NCC climate zones 7 and 8).\nPersistent condensation may also eventuate in other climates with poor detail or in special\ncircumstances, such as when high internal or ground moisture levels are not controlled,\nroofs are unable to adequately dry due to lack of outdoor ventilation or roofs are perpetually\nshaded\n\nsensed to Intertek Inform for All Roof Take-offs,\n\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\nCopyrighted material\n\nA3_ PROBLEMS CAUSED BY CONDENSATION\n\nPersistent condensation or condensate that is unable to dry can cause problems in buildings.\nThe cause is often due to poor design or inappropriate use of materials and once present can\nbe difficult to eliminate. Problems that may be encountered include rotting of timber or\ncorrosion of structural steel components, mould growth that may affect indoor air quality,\nreduction in the efficiency of bulk insulation, physical deterioration of ceilings made from\nabsorbent materials and staining of walls and ceilings. Often repair of condensation effects\nand retrospective control measures are significantly more expensive than measures\navailable to prevent condensation in the first instance.\n\n© Standards Australia www standards.org.au"
  },
  {
    "page": 27,
    "text": "2s AS 1562.1:2018\n\nA4 PREVENTING THE EFFECTS OF CONDENSATION\n\nThe underside of metal deck roofs provide conditions under which condensate may occur.\nInsulation, such as sarking, reflective foil, bubble foil or blanket and foil insulation placed\nbeneath the sheeting are of value in reducing the likelihood of condensate forming and\npotentially dripping from under roof sheeting. The insulation membranes should be vapour\nimpermeable to protect the metal roofing from moisture inside the building,\n\nWhen blanket insulation is placed beneath a metal deck roof it should incorporate\nimpermeable foil or similar and installed as a vapour barrier underneath the blanket\ninsulation to prevent moisture from inside the building penetrating and wetting the blanket\ninsulation.\n\nA minimum of draped sarking, reflective foil or bubble foil is recommended to reduce the\nprevalence of condensation in climates with cold winters (NCC climate zones 4, 7 and 8),\nnoting that blanket and foil will provide greater protection,\n\n‘Ventilation of the roof cavity may assist with removing moisture in the roof space. Minimal\n“trickle” ventilation is usually all that is required. Natural ventilation of roofs allowing air\nin at the eave or soffit and out at the ridge is often suitable for roofs with larger cavities,\nhowever, supplementary venting may be required where the roof cavity is made relatively\nair-tight including the need for greater condensation protection measures for very low pitch\nskillion roofs.\n\nUninsulated steel roof systems may be unsuitable for farm buildings used for intensive\nhusbandry of animals. These buildings, because of their occupation and purpose, may\ncontain air of a high relative humidity together with high concentrations of ammonia and\norganic acids. When these occur in the water condensed on the underside of the roof, rapid\ncorrosion will occur.\n\nIn buildings without ceilings, such as factories, condensate may fall on the machinery or\nstock in the space below and consideration should be given to the inclusion of insulation\nbeneath the metal deck roof to reduce this risk.\nNOTES:\n1 The information above may not be applicable to the tropics or homes that are built to meet\nbushfire requirements.\n\nsensed to Intertek Inform for All Roof Take-offs,\n\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\n2 Specialist advice should be sought for special purpose buildings, such as where high humidity\nmay exist, e.g. swimming pools or where high levels of environmental control are required,\ne.g. museums.\n\n3. Use of vapour permeable membranes beneath metal roofing are not commonly used in\nAustralia and expert guidance should be sought. The use of these membranes as an underlay\nbeneath metal roofing are common in New Zealand and work because of their installation\npractice and requirement for vapour permeability and absorptivity.\n\nCopyrighted material\n\n4 Condensation can occur for buildings that lock up moisture or water during construction that\nis subsequently unable to dry. Care should be taken to ensure that the building can dry and\nreach equilibrium prior to locking it up.\n\nwww standards.org.au @ Standards Australia"
  },
  {
    "page": 28,
    "text": "Copyrighted material licensed to Intertek Inform for All Roof Take-offs.\nNo further reproduction or distribution permitted. Printed / viewed by:allrooftakeoffs @gmail.com @ 29/05/2025\n\n© Standards Australia\n\nAS 1562.1:2018 26\n\nAPPENDIX B\nWATER PENETRATION\n(Informative)\n\nBl WATER PENETRATION\n\nCorrect installation of cladding and flashings will minimize water entry through the\nbuilding envelope. Water may penetrate the building envelope where flashings are not\nproperly installed (e.g. flashings that do not allow drainage from all pans or troughs in the\ncladding, or are inadequately fixed or inadequately overlapped with cladding). See\nClauses 4.7 and 4.8.\n\nWind in severe storms may cause the following effects:\n\n(a) Water may be driven up roof surfaces at or above the minimum pitch so that roofs do\nnot drain properly.\n\n(b) Differential pressure across the building envelope can force air that may have water\nentrained in it under flashings.\n\nConsideration in determining the extent of wind-driven rainwater ingress should be given\nto—\n\n(i) the length and pitch of the roof,\n(ii) _ the profile of the cladding and its water channel drainage capacity;\n(iii) _ the risk of ponding in the case of a low pitch roof;\n\n(iv) the potential penetration of water through end and side laps;\n\n(v) number of penetrations through cladding;\n\n(vi) complexity of flashings;\n\n(vii) size and pitch of valley gutters;\n\n(viii) length of lap of flashing over the sheeting; and\n\n(ix) overlap of adjoining flashing sections.\n\nB2 MINIMIZING WATER PENETRATION\n\nThe following references offer advice on installing flashings and reducing water penetration\nin cladding systems:\n\n(a) SAHB39.\n\n(b) NZ Acceptable Solution E2/AS1\n\n(c) NZ Metal Roof and Wall Cladding Code of Practice.\n\nTo provide an effective seal against wind-driven rain, most flashings should also be\ndesigned to protect against upward-moving water. This is particularly the case for flashings\nat the top of roof surfaces such as valley gutters, ridges or apron flashings. The gap between\nthe cladding and these flashings may also be sealed with closed-cell foam strips. Such strips\nneed to be anchored in position to resist wind pressures. Turned up edges of roofing and\nhems and hooks on flashings are required to achieve weatherproofing and also anchor the\nfoam strips.\n\nValley gutters should incorporate upstands or weather hooks on edges and tops. Closed cell\nfoam at the top of valley gutters will reduce the overtopping as wind drives water up the\nroof pitch (i.e. slope).\n\nwww standards.org.au"
  },
  {
    "page": 29,
    "text": "21 AS 1562.1:2018\n\nAPPENDIX C\nMATERIAL PROPERTIES\n\n(Informative)\n\nTable C1 provides guidance on coefficients for linear expansion of several materials.\nTables C2, C3 and C4 provide information on suitability of materials in direct contact or\nmoisture path from one surface to the next\n\nTABLE C1\n\nTYPICAL COEFFICIENT\nOF LINEAR EXPANSION\n\nBase materiat | Co*fficient of linear expansion\n\nwy\n‘Aluminium 24x 10-6\nCopper 17x 10-6\nSteel 12x 106\n\nStainless steel\nZine\n\n‘NOTE: Coefficient of linear expansion may be dependent\n‘on the metallurgy of the base material\n\nsensed to Intertek Inform for All Roof Take-offs.\n\nNo further reproduction or distribution permitted, Printed / viewed by:allrooftakeofis@gmail.com @ 29/06/2025\n\nTABLE C2\nCORROSION ZONES COMPARED TO EARLIER VERSIONS OF AS/NZS 2312\n= tegory my 2002 1994 an\nA co [wyew fas [a = =\nE 2 Low 1.3.25 B Mild Mild—rural arid\nL\n2 Mildura\ne\n& industrial\ng\nwaite | Neyer\nCau [very nism Paavo eae aie Wey vee\n\nNOTE: This Table is based on Table D1, Appendix D, of AS 4312\n\nwww standards.org.au @ Standards Australia"
  },
  {
    "page": 30,
    "text": "eyeasny sprepueis\n\nne-6vo'spuepues mma\n\nTABLE C3\nACCEPTABILITY OF DIRECT CONTACT BETWEEN METALS OR ALLOYS\n\n[Accessory or fastener material\n\nAluminium/zine and\nCopper and copper | Stainless stect_ | Zinc-coated steel | alumi\n\naluminium alloys alloys (300 series) and zine ‘magnesium alloy-\ncoated steet\n\nZinc-tin (20-30 %)\nLead mechanically plated\n\n(Cladding mater\n\njum/zine\n\nAtmospheric classifica\n\nStanavs] mia [stanavs| mia [stanavs] ma [si\n\navs] Mua [Stand vs Stand vs | Mua [Stanavs| mia\n\nAluminium and ver | Yes No No noe | ves | vest | vest | ves Yes No No Yes Yes\naluminium alloys\n\nCopper and copper alloys | _No No ves_| ves No Yes No No No No No Yes No No\nStainless stec! No No No No ver | Yes No No No No Yes No No\n(600 series)\n\nZinc-coated steel and zinc| Yes | Yes No No No ves | ves | ves | ver Yes No Yes Yes Yes\nAluminium/zine and yes | Yes No No No a en en No No Yes Yes\n\n‘luminium/zine\n\n‘magnesium alloy-coated\nsteel\n\nGrade 316 may be suitable\n+ Zinc-coated steel and zinc\nLEGEND:\n\n© suitable for diet contact, but are not suitable if drainage from an aluminium oF aluminium alloy roof passes over the fastener or accessory.\n\nSI, VS, Mild = severe industrial, very severe and mild classifications (refer to Table C2 for comparable climatic zone classifications)\nYes acceptable combination of metals\n\nNo not acceptable combination of metals\n\nNOTES:\n\n1 “Acceptable” and ‘not acceptable” imply the following:\n\nsion. It also implies that the\n\n() Acceptable As a result of bimetallic contact, either no additional cor\ndegree of corrosion would not significantly shorten the service life\n\nsion of the cladding system will take place or, atthe worst, slight additional cor\n\n(©) Not acceptable Moderate to severe corrosion of the cladding or accessories will occur, a condition which may result ina significant reduction in the service life\n\nUnless separation can be ensured, prepainted cladding materials should be considered in terms of the base material\n\n9ST SV\n\nsoz:\n\nav"
  }
]